[
    {
        "title": "BNS: Chapter I. Preliminary",
        "category": "Title, commencement, application, and definitions",
        "jurisdiction": "National",
        "sections": [
        {
            "number": "Section 1",
            "text": "(1) This Act may be called the Bharatiya Nyaya Sanhita, 2023. (2) It shall come into force on such date as the Central Government may, by notification in the Official Gazette, appoint, and different dates may be appointed for different provisions of this Sanhita. (3) Every person shall be liable to punishment under this Sanhita and not otherwise for every act or omission contrary to the provisions thereof, of which he shall be guilty within India. (4) Any person liable, by any law for the time being in force in India, to be tried for an offence committed beyond India shall be dealt with according to the provisions of this Sanhita for any act committed beyond India in the same manner as if such act had been committed within India. (5) The provisions of this Sanhita shall also apply to any offence committed by— (a) any citizen of India in any place without and beyond India; (b) any person on any ship or aircraft registered in India wherever it may be; (c) any person in any place without and beyond India committing offence targeting a computer resource located in India. (6) Nothing in this Sanhita shall affect the provisions of any Act for punishing mutiny and desertion of officers, soldiers, sailors or airmen in the service of the Government of India or the provisions of any special or local law.",
            "simple": "This section establishes the name of the law and states that the government decides when it starts[cite: 26, 27]. It applies to everyone within India, Indian citizens abroad, anyone on Indian ships or planes, and those targeting Indian computers from outside the country[cite: 34, 36, 37, 38]. It does not override laws regarding military desertion or specific local/special laws[cite: 43]."
        },
        {
            "number": "Section 2",
            "text": "In this Sanhita, unless the context otherwise requires,— (1) \"act\" denotes as well a series of acts as a single act; (2) \"animal\" means any living creature, other than a human being; (3) \"child\" means any person below the age of eighteen years; (4) \"counterfeit\"... (5) \"Court\" means a Judge... (6) \"death\" means the death of a human being... (7) \"dishonestly\" means doing anything with the intention of causing wrongful gain to one person or wrongful loss to another person; (8) \"document\"... includes electronic and digital record... (9) \"fraudulently\"... (10) \"gender\"... includes transgender... (11) \"good faith\"... (12) \"Government\"... (13) \"harbour\"... (14) \"injury\"... (15) \"illegal\"... (16) \"Judge\"... (17) \"life\"... (18) \"local law\"... (19) \"man\"... (20) \"month\" and \"year\"... (21) \"movable property\"... (22) \"number\"... (23) \"oath\"... (24) \"offence\"... (25) \"omission\"... (26) \"person\"... (27) \"public\"... (28) \"public servant\"... (29) \"reason to believe\"... (30) \"special law\"... (31) \"valuable security\"... (32) \"vessel\"... (33) \"voluntarily\"... (34) \"will\"... (35) \"woman\"... (36) \"wrongful gain\"... (37) \"wrongful loss\"... (38) \"gaining wrongfully\" and \"losing wrongfully\"... (39) words and expressions used but not defined in this Sanhita but defined in the Information Technology Act, 2000 and the Bharatiya Nagarik Suraksha Sanhita, 2023 shall have the meanings respectively assigned to them in that Act and Sanhita.",
            "simple": "This section provides 39 specific definitions used throughout the law [cite: 44-154]. Key updates include defining a 'child' as under 18 [cite: 47], including 'transgender' under gender [cite: 73], and expanding 'documents' to include digital and electronic records[cite: 54]. It also defines legal terms like 'dishonestly', 'public servant', and 'voluntarily'[cite: 53, 103, 142]."
        },
        {
            "number": "Section 3",
            "text": "(1) Throughout this Sanhita every definition of an offence, every penal provision, and every Illustration of every such definition or penal provision, shall be understood subject to the exceptions contained in the Chapter entitled \"General Exceptions\"... (2) Every expression which is explained in any Part of this Sanhita, is used in every Part of this Sanhita in conformity with the explanation. (3) When property is in the possession of a person's spouse, clerk or servant, on account of that person, it is in that person's possession within the meaning of this Sanhita. (4) In every Part of this Sanhita, except where a contrary intention appears from the context, words which refer to acts done extend also to illegal omissions. (5) When a criminal act is done by several persons in furtherance of the common intention of all, each of such persons is liable for that act in the same manner as if it were done by him alone... (7) Wherever the causing of a certain effect... is an offence, it is to be understood that the causing of that effect partly by an act and partly by an omission is the same offence... (9) Where several persons are engaged or concerned in the commission of a criminal act, they may be guilty of different offences by means of that act.",
            "simple": "This section explains how to interpret the law. It states that all crimes are subject to the 'General Exceptions' chapter[cite: 155, 156]. It introduces the 'Common Intention' rule: if a group commits a crime together, every member is equally responsible[cite: 170]. It also clarifies that 'acts' include 'illegal omissions' (failing to do something you are legally required to do)[cite: 169]."
        }
        ]
    },

    {
        "title": "BNS: Chapter II. Of Punishments",
        "category": "Types of punishments, commutation of sentences, and rules for fines and confinement",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 4",
            "text": "The punishments to which offenders are liable under the provisions of this Sanhita are— (a) Death; (b) Imprisonment for life; (c) Imprisonment, which is of two descriptions, namely:— (1) Rigorous, that is, with hard labour; (2) Simple; (d) Forfeiture of property; (e) Fine; (f) Community Service.",
            "simple": "This section lists the six types of legal penalties in India: the death penalty, life imprisonment, standard imprisonment (either hard labor or simple), seizing of property, monetary fines, and the newly introduced community service [cite: 208-216]."
          },
          {
            "number": "Section 5",
            "text": "The appropriate Government may, without the consent of the offender, commute any punishment under this Sanhita to any other punishment in accordance with section 474 of the Bharatiya Nagarik Suraksha Sanhita, 2023. Explanation.—For the purposes of this section the expression \"appropriate Government\" means.— (a) in cases where the sentence is a sentence of death or is for an offence against any law relating to a matter to which the executive power of the Union extends, the Central Government; and (b) in cases where the sentence (whether of death or not) is for an offence against any law relating to a matter to which the executive power of the State extends, the Government of the State within which the offender is sentenced.",
            "simple": "The government has the power to reduce or change a person's sentence to a less severe one without needing the person's permission[cite: 217]. [cite_start]The Central Government handles cases involving death sentences or federal laws, while State Governments handle cases involving state-level laws [cite: 218-221]."
          },
          {
            "number": "Section 6",
            "text": "In calculating fractions of terms of punishment, imprisonment for life shall be reckoned as equivalent to imprisonment for twenty years unless otherwise provided.",
            "simple": "When the law needs to calculate a fraction of a sentence (like 'half of the maximum punishment'), a life sentence is treated as being 20 years long for calculation purposes[cite: 222]."
          },
          {
            "number": "Section 7",
            "text": "In every case in which an offender is punishable with imprisonment which may be of either description, it shall be competent to the Court which sentences such offender to direct in the sentence that such imprisonment shall be wholly rigorous, or that such imprisonment shall be wholly simple, or that any part of such imprisonment shall be rigorous and the rest simple.",
            "simple": "A judge can decide if a jail sentence will involve hard labor (rigorous), no labor (simple), or a specific mix of both for different parts of the sentence[cite: 223]."
          },
          {
            "number": "Section 8",
            "text": "(1) Where no sum is expressed to which a fine may extend, the amount of fine to which the offender is liable is unlimited, but shall not be excessive. (2) ...it shall be competent to the Court... to direct by the sentence that, in default of payment of the fine, the offender shall suffer imprisonment for a certain term... (3) The term... shall not exceed one-fourth of the term of imprisonment which is the maximum fixed for the offence... (5) If the offence is punishable with fine or community service, the imprisonment... shall be simple, and... shall not exceed,— (a) two months when the amount of the fine does not exceed five thousand rupees; (b) four months when the amount of the fine does not exceed ten thousand rupees; and (c) one year in any other case.",
            "simple": "Fines must not be excessive even if the law doesn't set a limit[cite: 224]. [cite_start]If someone doesn't pay a fine, the court can order extra jail time[cite: 228]. [cite_start]This extra time generally cannot exceed 1/4th of the original maximum jail term [cite: 232][cite_start], or ranges from 2 months to 1 year for crimes only punishable by fine [cite: 234-237]."
          },
          {
            "number": "Section 9",
            "text": "(1) Where anything which is an offence is made up of parts, any of which parts is itself an offence, the offender shall not be punished with the punishment of more than one of such his offences, unless it be so expressly provided. (2) ...the offender shall not be punished with a more severe punishment than the Court which tries him could award for any one of such offences.",
            "simple": "If a single crime is made up of several smaller acts that are also crimes (like a beating made of many individual blows), the person is punished for the whole crime once, not for every single part [cite: 248, 266-268]."
          },
          {
            "number": "Section 10",
            "text": "In all cases in which judgment is given that a person is guilty of one of several offences specified in the judgment, but that it is doubtful of which of these offences he is guilty, the offender shall be punished for the offence for which the lowest punishment is provided if the same punishment is not provided for all.",
            "simple": "If a court is sure a person committed a crime but isn't sure which specific one (out of a few possibilities), the person must be given the lightest (lowest) possible punishment among those options[cite: 270]."
          },
          {
            "number": "Section 11",
            "text": "Whenever any person is convicted of an offence for which under this Sanhita the Court has power to sentence him to rigorous imprisonment, the Court may... order that the offender shall be kept in solitary confinement... not exceeding three months in the whole... (a) a time not exceeding one month if the term of imprisonment shall not exceed six months; (b) a time not exceeding two months if the term... shall not exceed one year; (c) a time not exceeding three months if the term... shall exceed one year.",
            "simple": "For crimes involving hard labor, a court can order solitary confinement[cite: 271]. [cite_start]The maximum total time is 3 months, based on the length of the sentence: 1 month for short sentences, 2 months for up to a year, and 3 months for long sentences [cite: 272-274]."
          },
          {
            "number": "Section 12",
            "text": "In executing a sentence of solitary confinement, such confinement shall in no case exceed fourteen days at a time, with intervals between the periods of solitary confinement of not less duration than such periods; and when the imprisonment awarded shall exceed three months, the solitary confinement shall not exceed seven days in any one month...",
            "simple": "Solitary confinement cannot be used all at once. [cite_start]It is limited to 14 days at a time with equal breaks in between[cite: 275]. [cite_start]If the sentence is longer than 3 months, the person can only be in solitary for 7 days per month[cite: 276]."
          },
          {
            "number": "Section 13",
            "text": "Whoever, having been convicted by a Court in India, of an offence punishable under Chapter X or Chapter XVII of this Sanhita with imprisonment... for a term of three years or upwards, shall be guilty of any offence punishable under either of those Chapters with like imprisonment... shall be subject for every such subsequent offence to imprisonment for life, or to imprisonment... which may extend to ten years.",
            "simple": "Repeat offenders who commit serious crimes involving property or currency (under Chapters X and XVII) face much harsher punishments, including life imprisonment or up to 10 years in prison for their subsequent crimes[cite: 277]."
          }
        ]
    },

    {
        "title": "BNS: Chapter III. General Exceptions",
        "category": "Situations where an act is not considered a crime",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 14",
            "text": "Nothing is an offence which is done by a person who is, or who by reason of a mistake of fact and not by reason of a mistake of law in good faith believes himself to be, bound by law to do it.",
            "simple": "An act is not a crime if the person was legally required to do it, or if they honestly believed they were required to do it because of a misunderstanding of the facts (but not a misunderstanding of the law)."
          },
          {
            "number": "Section 15",
            "text": "Nothing is an offence which is done by a Judge when acting judicially in the exercise of any power which is, or which in good faith he believes to be, given to him by law.",
            "simple": "A judge cannot be charged with a crime for actions taken while performing their official duties, provided they are acting within their legal power or honestly believe they are."
          },
          {
            "number": "Section 16",
            "text": "Nothing which is done in pursuance of, or which is warranted by the judgment or order of, a Court; if done whilst such judgment or order remains in force, is an offence, notwithstanding the Court may have had no jurisdiction to pass such judgment or order, provided the person doing the act in good faith believes that the Court had such jurisdiction.",
            "simple": "An act done following a court order is not a crime, even if the court didn't actually have the authority to give that order, as long as the person following it believed in good faith that the court was authorized."
          },
          {
            "number": "Section 17",
            "text": "Nothing is an offence which is done by any person who is justified by law, or who by reason of a mistake of fact and not by reason of a mistake of law in good faith, believes himself to be justified by law, in doing it.",
            "simple": "An act is not a crime if the law allows it, or if the person honestly thought the law allowed it due to a factual mistake."
          },
          {
            "number": "Section 18",
            "text": "Nothing is an offence which is done by accident or misfortune, and without any criminal intention or knowledge in the doing of a lawful act in a lawful manner by lawful means and with proper care and caution.",
            "simple": "A pure accident is not a crime if it happened while doing something legal, in a legal way, with proper care, and without any intention to cause harm."
          },
          {
            "number": "Section 19",
            "text": "Nothing is an offence merely by reason of its being done with the knowledge that it is likely to cause harm, if it be done without any criminal intention to cause harm, and in good faith for the purpose of preventing or avoiding other harm to person or property.",
            "simple": "Doing something that might cause harm is not a crime if it was done without bad intent and solely to prevent a much greater harm from happening."
          },
          {
            "number": "Section 20",
            "text": "Nothing is an offence which is done by a child under seven years of age.",
            "simple": "Children under the age of seven cannot be held criminally responsible for any act."
          },
          {
            "number": "Section 21",
            "text": "Nothing is an offence which is done by a child above seven years of age and under twelve years of age, who has not attained sufficient maturity of understanding to judge of the nature and consequences of his conduct on that occasion.",
            "simple": "Children between 7 and 12 are not responsible for a crime if they aren't mature enough to understand what they were doing or that it was wrong."
          },
          {
            "number": "Section 22",
            "text": "Nothing is an offence which is done by a person who, at the time of doing it, by reason of unsoundness of mind, is incapable of knowing the nature of the act, or that he is doing what is either wrong or contrary to law.",
            "simple": "An act is not a crime if the person, due to mental illness, did not understand what they were doing or did not know it was against the law."
          },
          {
            "number": "Section 23",
            "text": "Nothing is an offence which is done by a person who, at the time of doing it, is, by reason of intoxication, incapable of knowing the nature of the act, or that he is doing what is either wrong, or contrary to law; provided that the thing which intoxicated him was administered to him without his knowledge or against his will.",
            "simple": "A person is not responsible for a crime committed while intoxicated if they were drugged or forced to drink against their will and didn't know what they were doing."
          },
          {
            "number": "Section 24",
            "text": "In cases where an act done is not an offence unless done with a particular knowledge or intent, a person who does the act in a state of intoxication shall be liable to be dealt with as if he had the same knowledge as he would have had if he had not been intoxicated, unless the thing which intoxicated him was administered to him without his knowledge or against his will.",
            "simple": "If you get drunk voluntarily, the law assumes you have the same knowledge of your actions as a sober person. You only get a pass if the intoxication was forced upon you."
          },
          {
            "number": "Section 25",
            "text": "Nothing which is not intended to cause death, or grievous hurt, and which is not known by the doer to be likely to cause death or grievous hurt, is an offence by reason of any harm which it may cause... to any person, above eighteen years of age, who has given consent...",
            "simple": "If an adult consents to a risk (like a sport), and you don't intend to kill or seriously injure them, you aren't responsible for accidental harm caused during that activity."
          },
          {
            "number": "Section 26",
            "text": "Nothing, which is not intended to cause death, is an offence by reason of any harm... to any person for whose benefit it is done in good faith, and who has given a consent...",
            "simple": "A doctor performing surgery with the patient's consent is not a criminal for any harm caused, as long as they acted in good faith for the patient's benefit and didn't intend to cause death."
          },
          {
            "number": "Section 27",
            "text": "Nothing which is done in good faith for the benefit of a person under twelve years of age, or person of unsound mind, by, or by consent... of the guardian... is an offence by reason of any harm which it may cause...",
            "simple": "Guardians can give consent for medical or beneficial acts for children under 12 or mentally ill persons; the person performing the act is protected from criminal charges for harm caused in good faith."
          },
          {
            "number": "Section 28",
            "text": "A consent is not such a consent as is intended by any section of this Sanhita, (a) if the consent is given by a person under fear of injury, or under a misconception of fact... (b) if the person... is unable to understand the nature and consequence... (c) if the person is under twelve years of age.",
            "simple": "Consent is invalid if it's obtained through fear, lies, mental incapacity, or if the person is under 12 years old."
          },
          {
            "number": "Section 29",
            "text": "The exceptions in sections 25, 26 and 27 do not extend to acts which are offences independently of any harm which they may cause...",
            "simple": "You can't use 'consent' as an excuse for acts that are illegal on their own, regardless of whether someone agreed to them (like causing a miscarriage illegally)."
          },
          {
            "number": "Section 30",
            "text": "Nothing is an offence by reason of any harm which it may cause to a person for whose benefit it is done in good faith, even without that person's consent, if the circumstances are such that it is impossible for that person to signify consent...",
            "simple": "In an emergency where a person can't give consent (like being unconscious), a doctor or helper can act in good faith to save them without being charged for harm caused."
          },
          {
            "number": "Section 31",
            "text": "No communication made in good faith is an offence by reason of any harm to the person to whom it is made, if it is made for the benefit of that person.",
            "simple": "If a doctor tells a patient bad news in good faith and for their benefit, and the shock causes the patient harm, the doctor is not a criminal."
          },
          {
            "number": "Section 32",
            "text": "Except murder, and offences against the State punishable with death, nothing is an offence which is done by a person who is compelled to do it by threats, which... reasonably cause the apprehension that instant death to that person will otherwise be the consequence...",
            "simple": "If someone forces you to commit a crime (other than murder or treason) by threatening to kill you instantly, you are not responsible. However, this doesn't count if you joined a criminal gang voluntarily."
          },
          {
            "number": "Section 33",
            "text": "Nothing is an offence by reason that it causes... any harm, if that harm is so slight that no person of ordinary sense and temper would complain of such harm.",
            "simple": "The law doesn't care about 'trifles'—harm so small that a reasonable person wouldn't bother complaining about it."
          },
          {
            "number": "Section 34",
            "text": "Nothing is an offence which is done in the exercise of the right of private defence.",
            "simple": "Acts done to protect yourself or others within the limits of the law are not crimes."
          },
          {
            "number": "Section 35",
            "text": "Every person has a right... to defend (a) his own body, and the body of any other person... (b) the property... of himself or of any other person, against any act which is an offence falling under the definition of theft, robbery, mischief or criminal trespass...",
            "simple": "You have the right to use force to protect your body (or someone else's) from injury, and your property (or someone else's) from crimes like theft or trespassing."
          },
          {
            "number": "Section 36",
            "text": "When an act, which would otherwise be a certain offence, is not that offence, by reason of the youth, the want of maturity... the unsoundness of mind or the intoxication... every person has the same right of private defence against that act which he would have if the act were that offence.",
            "simple": "You have the right to defend yourself even if the person attacking you isn't legally responsible for their actions (like a child or a mentally ill person)."
          },
          {
            "number": "Section 37",
            "text": "(1) There is no right of private defence,— (a) against an act which does not reasonably cause the apprehension of death or of grievous hurt, if done... by a public servant acting in good faith... (c) in cases in which there is time to have recourse to the protection of the public authorities.",
            "simple": "You can't claim self-defense against a police officer doing their job (unless you fear they will kill or seriously injure you), nor can you use force if you have enough time to call the police for help."
          },
          {
            "number": "Section 38",
            "text": "The right of private defence of the body extends... to the voluntary causing of death or of any other harm to the assailant, if the offence... be of any of the descriptions... (a) apprehension that death will otherwise be the consequence... (c) intention of committing rape... (g) throwing or administering acid...",
            "simple": "You are allowed to kill an attacker in self-defense if you reasonably believe they are about to kill you, cause serious injury, commit rape, kidnap someone, or throw acid."
          },
          {
            "number": "Section 39",
            "text": "If the offence be not of any of the descriptions specified in section 38, the right of private defence of the body does not extend to the voluntary causing of death... but does extend... to the voluntary causing... of any harm other than death.",
            "simple": "If the threat isn't one of the extreme ones listed in Section 38, you can defend yourself but you are not allowed to kill the attacker."
          },
          {
            "number": "Section 40",
            "text": "The right of private defence of the body commences as soon as a reasonable apprehension of danger to the body arises... and it continues as long as such apprehension... continues.",
            "simple": "Your right to defend yourself starts the moment you feel threatened and ends once the danger has passed."
          },
          {
            "number": "Section 41",
            "text": "The right of private defence of property extends... to the voluntary causing of death... if the offence... be... (a) robbery; (b) house-breaking after sunset and before sunrise; (c) mischief by fire... (d) theft, mischief, or house-trespass... causing apprehension that death or grievous hurt will be the consequence...",
            "simple": "You can kill someone to protect property only in extreme cases like robbery, house-breaking at night, burning down a building, or if you fear you will be killed while protecting the property."
          },
          {
            "number": "Section 42",
            "text": "If the offence... be theft, mischief, or criminal trespass, not of any of the descriptions specified in section 41, that right does not extend to the voluntary causing of death, but does extend... to... any harm other than death.",
            "simple": "For simple theft or trespassing, you can use force to protect your property, but you are not allowed to kill the person."
          },
          {
            "number": "Section 43",
            "text": "The right of private defence of property,— (a) commences when a reasonable apprehension of danger to the property commences; (b) against theft continues till the offender has effected his retreat... or the property has been recovered...",
            "simple": "The right to protect property starts when the danger starts and lasts until the thief runs away, you get the police's help, or you get your stuff back."
          },
          {
            "number": "Section 44",
            "text": "If in the exercise of the right of private defence against an assault which reasonably causes the apprehension of death, the defender be so situated that he cannot effectually exercise that right without risk of harm to an innocent person, his right of private defence extends to the running of that risk.",
            "simple": "If you have to defend yourself against a deadly attack and an innocent person might get hurt in the process (like firing into a mob to stop a killer), you are not a criminal for taking that risk."
          }
        ]
    },

    {
        "title": "BNS: Chapter IV. Of Abetment, Criminal Conspiracy and Attempt",
        "category": "Rules regarding helping, planning, or trying to commit a crime",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 45",
            "text": "A person abets the doing of a thing, who— (a) instigates any person to do that thing; or (b) engages with one or more other person or persons in any conspiracy for the doing of that thing... or (c) intentionally aids, by any act or illegal omission, the doing of that thing.",
            "simple": "A person is guilty of abetment if they encourage someone to commit a crime, join a plan (conspiracy) to do it, or help in any way (including by staying silent when they should have acted)."
          },
          {
            "number": "Section 46",
            "text": "A person abets an offence, who abets either the commission of an offence, or the commission of an act which would be an offence, if committed by a person capable by law of committing an offence with the same intention or knowledge as that of the abettor.",
            "simple": "You are an abettor if you help someone commit a crime, even if the person you helped isn't legally capable of committing a crime themselves (like a child or someone mentally ill)."
          },
          {
            "number": "Section 47",
            "text": "A person abets an offence within the meaning of this Sanhita who, in India, abets the commission of any act without and beyond India which would constitute an offence if committed in India.",
            "simple": "If you are in India and you help or plan a crime that takes place in another country, you are treated as if the crime happened in India."
          },
          {
            "number": "Section 48",
            "text": "A person abets an offence within the meaning of this Sanhita who, without and beyond India, abets the commission of any act in India which would constitute an offence if committed in India.",
            "simple": "If you are outside India and you help or plan a crime that happens inside India, you are guilty of abetment under Indian law."
          },
          {
            "number": "Section 49",
            "text": "Whoever abets any offence shall, if the act abetted is committed in consequence of the abetment, and no express provision is made by this Sanhita for the punishment of such abetment, be punished with the punishment provided for the offence.",
            "simple": "If the crime you helped with actually happens, and there isn't a specific rule for your punishment, you get the exact same punishment as the person who committed the crime."
          },
          {
            "number": "Section 50",
            "text": "Whoever abets the commission of an offence shall, if the person abetted does the act with a different intention or knowledge from that of the abettor, be punished with the punishment provided for the offence which would have been committed if the act had been done with the intention or knowledge of the abettor and with no other.",
            "simple": "If you help someone do something bad, but they have a different motive than you, you are punished based on what *you* intended to happen."
          },
          {
            "number": "Section 51",
            "text": "When an act is abetted and a different act is done, the abettor is liable for the act done, in the same manner and to the same extent as if he had directly abetted it: Provided that the act done was a probable consequence of the abetment...",
            "simple": "If you help someone commit one crime, but they end up committing a different one that was a likely result of your help, you are responsible for that new crime too."
          },
          {
            "number": "Section 52",
            "text": "If the act for which the abettor is liable under section 51 is committed in addition to the act abetted, and constitute a distinct offence, the abettor is liable to punishment for each of the offences.",
            "simple": "If the person you helped commits the crime you planned *plus* another related crime, you can be punished for both."
          },
          {
            "number": "Section 53",
            "text": "When an act is abetted with the intention on the part of the abettor of causing a particular effect, and an act... causes a different effect from that intended... the abettor is liable for the effect caused... provided he knew that the act abetted was likely to cause that effect.",
            "simple": "If you help someone cause harm, and the result is worse than you planned (like death instead of just an injury), you are responsible for the worse result if you knew it was a possibility."
          },
          {
            "number": "Section 54",
            "text": "Whenever any person, who is absent would be liable to be punished as an abettor, is present when the act or offence for which he would be punishable... is committed, he shall be deemed to have committed such act or offence.",
            "simple": "If you helped plan a crime and you are actually there when it happens, the law treats you as if you did the crime yourself."
          },
          {
            "number": "Section 55",
            "text": "Whoever abets the commission of an offence punishable with death or imprisonment for life, shall, if that offence be not committed... be punished with imprisonment... for a term which may extend to seven years, and shall also be liable to fine...",
            "simple": "If you help or plan a very serious crime (like murder) but it doesn't actually happen, you still face up to 7 years in prison. If someone gets hurt during the attempt, you face up to 14 years."
          },
          {
            "number": "Section 56",
            "text": "Whoever abets an offence punishable with imprisonment shall, if that offence be not committed... be punished with imprisonment... for a term which may extend to one-fourth part of the longest term provided for that offence...",
            "simple": "If you help with a crime but it isn't committed, you get 1/4th of the maximum punishment for that crime. If you are a public servant whose job was to prevent that crime, you get 1/2 of the punishment."
          },
          {
            "number": "Section 57",
            "text": "Whoever abets the commission of an offence by the public generally or by any number or class of persons exceeding ten, shall be punished with imprisonment... which may extend to seven years and with fine.",
            "simple": "If you encourage a group of more than 10 people or the general public to commit a crime, you face up to 7 years in prison."
          },
          {
            "number": "Section 58",
            "text": "Whoever intending to facilitate... the commission of an offence punishable with death or imprisonment for life, voluntarily conceals by any act or omission, or by the use of encryption... the existence of a design to commit such offence...",
            "simple": "If you know about a plan for a major crime and you hide it—including using encryption or secret tools to help it happen—you can be jailed for up to 7 years if the crime happens, or 3 years if it doesn't."
          },
          {
            "number": "Section 59",
            "text": "Whoever, being a public servant, intending to facilitate... the commission of an offence which it is his duty as such public servant to prevent, voluntarily conceals... the existence of a design to commit such offence...",
            "simple": "If a public servant (like a police officer) hides a criminal plan they were supposed to stop, they face severe penalties—up to half of the crime's maximum punishment or up to 10 years for serious crimes."
          },
          {
            "number": "Section 60",
            "text": "Whoever, intending to facilitate... the commission of an offence punishable with imprisonment, voluntarily conceals... the existence of a design to commit such offence...",
            "simple": "If you hide a plan for a crime that carries a jail sentence, you can be jailed for 1/4th of the term if the crime happens, or 1/8th if it doesn't."
          },
          {
            "number": "Section 61",
            "text": "(1) When two or more persons agree with the common object to do... (a) an illegal act; or (b) an act which is not illegal by illegal means, such an agreement is designated a criminal conspiracy...",
            "simple": "Criminal conspiracy is when two or more people agree to do something illegal or do something legal using illegal methods. Just agreeing is a crime if the goal is a serious offense; for other goals, some action must be taken toward the plan."
          },
          {
            "number": "Section 62",
            "text": "Whoever attempts to commit an offence punishable by this Sanhita with imprisonment for life or imprisonment... and in such attempt does any act towards the commission of the offence...",
            "simple": "If you try to commit a crime but fail, you are still punished. Generally, you get half of the jail time or fine that the actual crime would have carried."
          }
        ]
    },

    {
        "title": "BNS: Chapter V. Of Offences Against Woman and Child",
        "category": "Offences relating to sexual violence, marriage, miscarriage, and crimes against children",
        "jurisdiction": "National",
        "sections": [
            {
                "number": "Section 63",
                "text": "A man is said to commit 'rape' if he— (a) penetrates his penis, to any extent, into the vagina, mouth, urethra or anus of a woman or makes her to do so with him or any other person; or (b) inserts, to any extent, any object or a part of the body, not being the penis, into the vagina, the urethra or anus of a woman or makes her to do so with him or any other person; or (c) manipulates any part of the body of a woman so as to cause penetration into the vagina, urethra, anus or any part of body of such woman or makes her to do so with him or any other person; or (d) applies his mouth to the vagina, anus, urethra of a woman or makes her to do so with him or any other person, under the circumstances falling under any of the following seven descriptions:— (i) against her will; (ii) without her consent; (iii) with her consent, when her consent has been obtained by putting her or any person in whom she is interested, in fear of death or of hurt; (iv) with her consent, when the man knows that he is not her husband and that her consent is given because she believes that he is another man to whom she is or believes herself to be lawfully married; (v) with her consent when, at the time of giving such consent, by reason of unsoundness of mind or intoxication or the administration by him personally or through another of any stupefying or unwholesome substance, she is unable to understand the nature and consequences of that to which she gives consent; (vi) with or without her consent, when she is under eighteen years of age; (vii) when she is unable to communicate consent.",
                "simple": "Defines rape as various acts of sexual penetration or contact committed without the woman's voluntary consent, against her will, or through deception/coercion. It includes specific provisions for victims under 18 and those unable to give consent due to mental state or intoxication."
            },
            {
                "number": "Section 64",
                "text": "(1) Whoever, except in the cases provided for in sub-section (2), commits rape, shall be punished with rigorous imprisonment of either description for a term which shall not be less than ten years, but which may extend to imprisonment for life, and shall also be liable to fine. (2) [Detailed list of aggravated circumstances including rape by police officers, public servants, armed forces, staff of jails/hospitals, relatives, or during communal violence].",
                "simple": "Sets the punishment for rape at a minimum of 10 years, extending to life imprisonment. Harsher penalties apply to individuals in positions of trust or authority, such as police, public servants, or medical staff."
            },
            {
                "number": "Section 65",
                "text": "(1) Whoever, commits rape on a woman under sixteen years of age shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life, which shall mean imprisonment for the remainder of that person's natural life, and shall also be liable to fine. (2) Whoever, commits rape on a woman under twelve years of age shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life... and with fine or with death.",
                "simple": "Provides severe punishments for the rape of minors: a minimum of 20 years for victims under 16, and a minimum of 20 years to the death penalty for victims under 12."
            },
            {
                "number": "Section 66",
                "text": "Whoever, commits an offence punishable under sub-section (1) or sub-section (2) of section 64 and in the course of such commission inflicts an injury which causes the death of the woman or causes the woman to be in a persistent vegetative state, shall be punished with rigorous imprisonment for a term which shall not be less than twenty years, but which may extend to imprisonment for life... or with death.",
                "simple": "Imposes a minimum of 20 years, life imprisonment, or the death penalty if a rape results in the victim's death or a persistent vegetative state."
            },
            {
                "number": "Section 67",
                "text": "Whoever has sexual intercourse with his own wife, who is living separately, whether under a decree of separation or otherwise, without her consent, shall be punished with imprisonment of either description for a term which shall not be less than two years but which may extend to seven years, and shall also be liable to fine.",
                "simple": "Criminalizes non-consensual sexual intercourse by a husband with his wife if they are legally separated."
            },
            {
                "number": "Section 68",
                "text": "Whoever, being in a position of authority or in a fiduciary relationship; or a public servant... abuses such position or fiduciary relationship to induce or seduce any woman... to have sexual intercourse with him, such sexual intercourse not amounting to the offence of rape, shall be punished with rigorous imprisonment... not less than five years, but which may extend to ten years, and shall also be liable to fine.",
                "simple": "Punishes individuals in authority who use their position to coerce a woman into sexual intercourse, even if it does not legally qualify as rape."
            },
            {
                "number": "Section 69",
                "text": "Whoever, by deceitful means or by making promise to marry to a woman without any intention of fulfilling the same, has sexual intercourse with her, such sexual intercourse not amounting to the offence of rape, shall be punished with imprisonment of either description for a term which may extend to ten years and shall also be liable to fine.",
                "simple": "Criminalizes sexual intercourse obtained through deceit, such as a false promise of marriage or suppressing one's true identity."
            },
            {
                "number": "Section 70",
                "text": "(1) Where a woman is raped by one or more persons constituting a group or acting in furtherance of a common intention, each of those persons shall be deemed to have committed the offence of rape and shall be punished with rigorous imprisonment for a term which shall not be less than twenty years... or for life. (2) Where a woman under eighteen years of age is raped... [punished with life imprisonment or death].",
                "simple": "Defines gang rape and mandates a minimum of 20 years in prison for each participant. If the victim is under 18, the penalty increases to life imprisonment or death."
            },
            {
                "number": "Section 71",
                "text": "Whoever has been previously convicted of an offence punishable under section 64 or section 65 or section 66 or section 70 and is subsequently convicted... shall be punished with imprisonment for life... or with death.",
                "simple": "Mandates life imprisonment or the death penalty for repeat offenders of serious sexual crimes."
            },
            {
                "number": "Section 72",
                "text": "(1) Whoever prints or publishes the name or any matter which may make known the identity of any person against whom an offence under section 64 [to 71] is alleged... shall be punished with imprisonment... which may extend to two years and shall also be liable to fine.",
                "simple": "Prohibits the disclosure of a sexual assault victim's identity in the media or public domain, punishable by up to two years in prison."
            },
            {
                "number": "Section 73",
                "text": "Whoever prints or publishes any matter in relation to any proceeding before a Court with respect to an offence referred to in section 72 without the previous permission of such Court shall be punished with imprisonment... which may extend to two years and shall also be liable to fine.",
                "simple": "Prohibits publishing details of court proceedings regarding sexual offences without court permission."
            },
            {
                "number": "Section 74",
                "text": "Whoever assaults or uses criminal force to any woman, intending to outrage or knowing it to be likely that he will thereby outrage her modesty, shall be punished with imprisonment... not less than one year but which may extend to five years, and shall also be liable to fine.",
                "simple": "Punishes actions intended to outrage a woman's modesty with 1 to 5 years in prison."
            },
            {
                "number": "Section 75",
                "text": "(1) A man committing any of the following acts:— (i) physical contact and advances involving unwelcome and explicit sexual overtures; or (ii) a demand or request for sexual favours; or (iii) showing pornography against the will of a woman; or (iv) making sexually coloured remarks, shall be guilty of the offence of sexual harassment.",
                "simple": "Defines sexual harassment and sets punishments ranging from 1 to 3 years in prison depending on the nature of the act."
            },
            {
                "number": "Section 76",
                "text": "Whoever assaults or uses criminal force to any woman or abets such act with the intention of disrobing or compelling her to be naked, shall be punished with imprisonment... not less than three years but which may extend to seven years, and shall also be liable to fine.",
                "simple": "Specifically punishes the act of using force to disrobe a woman with 3 to 7 years in prison."
            },
            {
                "number": "Section 77",
                "text": "Whoever watches, or captures the image of a woman engaging in a private act in circumstances where she would usually have the expectation of not being observed... or disseminates such image shall be punished... [with 1 to 7 years imprisonment].",
                "simple": "Defines and punishes voyeurism, including capturing or sharing images of a woman in a private setting without her consent."
            },
            {
                "number": "Section 78",
                "text": "(1) Any man who— (i) follows a woman and contacts... repeatedly despite a clear indication of disinterest... or (ii) monitors the use by a woman of the internet... commits the offence of stalking.",
                "simple": "Defines stalking as repeatedly following or contacting a woman against her will, or monitoring her electronic communications. Punishment is up to 3 years for the first offense."
            },
            {
                "number": "Section 79",
                "text": "Whoever, intending to insult the modesty of any woman, utters any words, makes any sound or gesture, or exhibits any object... or intrudes upon the privacy of such woman, shall be punished with simple imprisonment for a term which may extend to three years, and also with fine.",
                "simple": "Punishes verbal or physical gestures and words intended to insult a woman's modesty or privacy."
            },
            {
                "number": "Section 80",
                "text": "(1) Where the death of a woman is caused by any burns or bodily injury or occurs otherwise than under normal circumstances within seven years of her marriage and it is shown that soon before her death she was subjected to cruelty or harassment... in connection with, any demand for dowry, such death shall be called 'dowry death'.",
                "simple": "Defines dowry death for suspicious deaths within 7 years of marriage involving dowry harassment. Punishment is 7 years to life imprisonment."
            },
            {
                "number": "Section 81",
                "text": "Every man who by deceit causes any woman who is not lawfully married to him to believe that she is lawfully married to him and to cohabit or have sexual intercourse with him in that belief, shall be punished with imprisonment... which may extend to ten years, and shall also be liable to fine.",
                "simple": "Punishes men who trick women into cohabiting or having sex by falsely making them believe they are legally married."
            },
            {
                "number": "Section 82",
                "text": "(1) Whoever, having a husband or wife living, marries in any case in which such marriage is void by reason of its taking place during the life of such husband or wife, shall be punished with imprisonment... which may extend to seven years, and shall also be liable to fine.",
                "simple": "Criminalizes bigamy (marrying again while a previous marriage is still valid), except in specific cases of court-declared voids or long-term disappearance."
            },
            {
                "number": "Section 83",
                "text": "Whoever, dishonestly or with a fraudulent intention, goes through the ceremony of being married, knowing that he is not thereby lawfully married, shall be punished with imprisonment... which may extend to seven years, and shall also be liable to fine.",
                "simple": "Punishes the act of performing a fraudulent or mock marriage ceremony with up to 7 years in prison."
            },
            {
                "number": "Section 84",
                "text": "Whoever takes or entices away any woman who is and whom he knows or has reason to believe to be the wife of any other man, with intent that she may have illicit intercourse with any person... shall be punished with imprisonment... which may extend to two years, or with fine, or with both.",
                "simple": "Punishes enticing or detaining a married woman for the purpose of illicit intercourse."
            },
            {
                "number": "Section 85",
                "text": "Whoever, being the husband or the relative of the husband of a woman, subjects such woman to cruelty shall be punished with imprisonment for a term which may extend to three years and shall also be liable to fine.",
                "simple": "Criminalizes marital cruelty by a husband or his relatives."
            },
            {
                "number": "Section 86",
                "text": "For the purposes of section 85, 'cruelty' means— (a) any wilful conduct which is of such a nature as is likely to drive the woman to commit suicide or to cause grave injury... or (b) harassment... with a view to coercing her... to meet any unlawful demand for any property or valuable security.",
                "simple": "Defines cruelty as conduct likely to lead to suicide or serious injury, or harassment related to dowry or property demands."
            },
            {
                "number": "Section 87",
                "text": "Whoever kidnaps or abducts any woman with intent that she may be compelled... to marry any person against her will... shall be punished with imprisonment... which may extend to ten years, and shall also be liable to fine.",
                "simple": "Punishes kidnapping or abducting a woman to force her into marriage or illicit intercourse."
            },
            {
                "number": "Section 88",
                "text": "Whoever voluntarily causes a woman with child to miscarry, shall, if such miscarriage be not caused in good faith for the purpose of saving the life of the woman, be punished with imprisonment... which may extend to three years, or with fine, or with both.",
                "simple": "Criminalizes causing a miscarriage unless it is done in good faith to save the mother's life."
            },
            {
                "number": "Section 89",
                "text": "Whoever commits the offence under section 88 without the consent of the woman... shall be punished with imprisonment for life, or with imprisonment... which may extend to ten years, and shall also be liable to fine.",
                "simple": "Imposes much harsher penalties (up to life imprisonment) for causing a miscarriage without the woman's consent."
            },
            {
                "number": "Section 90",
                "text": "(1) Whoever, with intent to cause the miscarriage of a woman with child, does any act which causes the death of such woman, shall be punished with imprisonment... which may extend to ten years, and shall also be liable to fine.",
                "simple": "Punishes causing the death of a woman while attempting to cause a miscarriage, with increased penalties if done without her consent."
            },
            {
                "number": "Section 91",
                "text": "Whoever before the birth of any child does any act with the intention of thereby preventing that child from being born alive... shall, if such act be not caused in good faith for the purpose of saving the life of the mother, be punished with imprisonment... which may extend to ten years, or with fine, or with both.",
                "simple": "Punishes acts intended to prevent a child from being born alive or to cause its death after birth, unless done to save the mother."
            },
            {
                "number": "Section 92",
                "text": "Whoever does any act under such circumstances, that if he thereby caused death he would be guilty of culpable homicide, and does by such act cause the death of a quick unborn child, shall be punished with imprisonment... which may extend to ten years, and shall also be liable to fine.",
                "simple": "Punishes causing the death of a 'quick' (moving) unborn child through an act that would otherwise be considered homicide."
            },
            {
                "number": "Section 93",
                "text": "Whoever being the father or mother of a child under the age of twelve years, or having the care of such child, shall expose or leave such child in any place with the intention of wholly abandoning such child, shall be punished with imprisonment... which may extend to seven years, or with fine, or with both.",
                "simple": "Punishes the abandonment of a child under 12 years of age by a parent or guardian."
            },
            {
                "number": "Section 94",
                "text": "Whoever, by secretly burying or otherwise disposing of the dead body of a child... intentionally conceals or endeavours to conceal the birth of such child, shall be punished with imprisonment... which may extend to two years, or with fine, or with both.",
                "simple": "Criminalizes the secret disposal of a child's body to hide its birth."
            },
            {
                "number": "Section 95",
                "text": "Whoever hires, employs or engages any child to commit an offence shall be punished with imprisonment... not less than three years but which may extend to ten years, and with fine.",
                "simple": "Punishes using a child to commit crimes, including for sexual exploitation or pornography."
            },
            {
                "number": "Section 96",
                "text": "Whoever, by any means whatsoever, induces any child to go from any place... with intent that such child may be... forced or seduced to illicit intercourse with another person shall be punishable with imprisonment which may extend to ten years, and shall also be liable to fine.",
                "simple": "Criminalizes inducing a child to go anywhere for the purpose of sexual exploitation."
            },
            {
                "number": "Section 97",
                "text": "Whoever kidnaps or abducts any child under the age of ten years with the intention of taking dishonestly any movable property from the person of such child, shall be punished with imprisonment... which may extend to seven years, and shall also be liable to fine.",
                "simple": "Punishes kidnapping or abducting a child under 10 with the intent to steal from them."
            },
            {
                "number": "Section 98",
                "text": "Whoever sells, lets to hire, or otherwise disposes of any child with intent that such child shall at any age be employed or used for the purpose of prostitution or illicit intercourse... shall be punished with imprisonment... which may extend to ten years, and shall also be liable to fine.",
                "simple": "Punishes selling or hiring out a child for prostitution or sexual exploitation."
            },
            {
                "number": "Section 99",
                "text": "Whoever buys, hires or otherwise obtains possession of any child with intent that such child shall at any age be employed or used for the purpose of prostitution or illicit intercourse... shall be punished with imprisonment... not less than seven years but which may extend to fourteen years, and shall also be liable to fine.",
                "simple": "Punishes buying or hiring a child for the purpose of sexual exploitation with 7 to 14 years in prison."
            }
        ]
    },

    {
        "title": "BNS: Chapter VI. Of Offences Affecting the Human Body",
        "category": "Offences affecting life, hurt, wrongful restraint, criminal force, and kidnapping",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 100",
            "text": "Whoever causes death by doing an act with the intention of causing death, or with the intention of causing such bodily injury as is likely to cause death, or with the knowledge that he is likely by such act to cause death, commits the offence of culpable homicide.",
            "simple": "Defines culpable homicide as causing death with the intent to kill, intent to cause serious injury likely to kill, or knowledge that the act will likely result in death."
          },
          {
            "number": "Section 101",
            "text": "Except in the cases hereinafter excepted, culpable homicide is murder,— (a) if the act by which the death is caused is done with the intention of causing death; or (b) [intent to cause injury known to likely cause death]; or (c) [injury sufficient in ordinary course of nature to cause death]; or (d) [act so imminently dangerous that it must in all probability cause death].",
            "simple": "Defines murder as culpable homicide committed with specific intent or extreme knowledge of the danger. It includes exceptions for grave provocation, self-defense, public service duties, sudden fights, and consent."
          },
          {
            "number": "Section 102",
            "text": "If a person, by doing anything which he intends or knows to be likely to cause death, commits culpable homicide by causing the death of any person, whose death he neither intends nor knows himself to be likely to cause, the culpable homicide committed by the offender is of the description of which it would have been if he had caused the death of the person whose death he intended or knew himself to be likely to cause.",
            "simple": "Known as 'transferred malice,' this states that if you intend to kill one person but accidentally kill another, you are still guilty of the crime as if you had killed the intended person."
          },
          {
            "number": "Section 103",
            "text": "(1) Whoever commits murder shall be punished with death or imprisonment for life, and shall also be liable to fine. (2) When a group of five or more persons acting in concert commits murder on the ground of race, caste or community, sex, place of birth, language, personal belief or any other similar ground each member of such group shall be punished with death or with imprisonment for life, and shall also be liable to fine.",
            "simple": "Sets the punishment for murder as death or life imprisonment. Sub-section 2 specifically introduces the punishment for mob lynching or group-based murder."
          },
          {
            "number": "Section 104",
            "text": "Whoever, being under sentence of imprisonment for life, commits murder, shall be punished with death or with imprisonment for life, which shall mean the remainder of that person's natural life.",
            "simple": "Prescribes death or natural-life imprisonment for someone who commits murder while already serving a life sentence."
          },
          {
            "number": "Section 105",
            "text": "Whoever commits culpable homicide not amounting to murder, shall be punished with imprisonment for life, or imprisonment... not less than five years but which may extend to ten years... or with imprisonment... which may extend to ten years and with fine [if done with knowledge but without intent].",
            "simple": "Provides different levels of punishment for culpable homicide that is not murder, depending on whether there was specific intent or just knowledge of the risk."
          },
          {
            "number": "Section 106",
            "text": "(1) Whoever causes death of any person by doing any rash or negligent act not amounting to culpable homicide, shall be punished with imprisonment... which may extend to five years... [2 years for medical practitioners]. (2) Whoever causes death... by rash and negligent driving... and escapes without reporting it to a police officer or a Magistrate soon after the incident, shall be punished with imprisonment... which may extend to ten years.",
            "simple": "Punishes accidental deaths caused by negligence. It includes a specific provision for doctors and introduces a much higher 10-year penalty for 'hit-and-run' cases."
          },
          {
            "number": "Section 107",
            "text": "If any child, any person of unsound mind, any delirious person or any person in a state of intoxication, commits suicide, whoever abets the commission of such suicide, shall be punished with death or imprisonment for life, or imprisonment for a term not exceeding ten years, and shall also be liable to fine.",
            "simple": "Imposes severe penalties, up to the death penalty, for helping a child or mentally incapacitated person commit suicide."
          },
          {
            "number": "Section 108",
            "text": "If any person commits suicide, whoever abets the commission of such suicide, shall be punished with imprisonment... which may extend to ten years, and shall also be liable to fine.",
            "simple": "Punishes the abetment (encouragement or assistance) of suicide with up to 10 years in prison."
          },
          {
            "number": "Section 109",
            "text": "(1) Whoever does any act with such intention or knowledge... that, if he by that act caused death, he would be guilty of murder, shall be punished with imprisonment... which may extend to ten years... (2) [If the offender is a life-convict and hurt is caused, the penalty can be death].",
            "simple": "Punishes attempted murder with up to 10 years in prison, or life/death if injury is caused by a life-convict."
          },
          {
            "number": "Section 110",
            "text": "Whoever does any act with such intention or knowledge... that, if he by that act caused death, he would be guilty of culpable homicide not amounting to murder, shall be punished with imprisonment... which may extend to three years... [up to 7 years if hurt is caused].",
            "simple": "Punishes attempts to commit culpable homicide (which is less severe than attempted murder)."
          },
          {
            "number": "Section 111",
            "text": "(1) Any continuing unlawful activity... by any person or a group... either as a member of an organised crime syndicate or on behalf of such syndicate... shall constitute organised crime. [Punishment: death or life imprisonment if death results; 5 years to life otherwise].",
            "simple": "A new section defining 'Organised Crime' (like kidnapping, robbery, trafficking, or economic offences) and providing heavy penalties including death."
          },
          {
            "number": "Section 112",
            "text": "(1) Whoever, being a member of a group or gang, either singly or jointly, commits any act of theft, snatching, cheating, unauthorised selling of tickets... is said to commit petty organised crime. [Punishment: 1 to 7 years].",
            "simple": "A new section targeting common group crimes like snatching, pickpocketing, or ticket scamming."
          },
          {
            "number": "Section 113",
            "text": "(1) Whoever does any act with the intent to threaten or likely to threaten the unity, integrity, sovereignty, security, or economic security of India... commits a terrorist act. [Punishment: death or life imprisonment if death results; 5 years to life otherwise].",
            "simple": "A comprehensive new section defining and punishing terrorism, including economic terrorism and use of hazardous substances."
          },
          {
            "number": "Section 114",
            "text": "Whoever causes bodily pain, disease or infirmity to any person is said to cause hurt.",
            "simple": "Defines basic 'hurt' as causing pain, sickness, or weakness."
          },
          {
            "number": "Section 115",
            "text": "(1) Whoever does any act with the intention of thereby causing hurt to any person... is said 'voluntarily to cause hurt'. [Punishment: up to 1 year and/or 10,000 rupee fine].",
            "simple": "Punishes intentionally causing simple bodily pain."
          },
          {
            "number": "Section 116",
            "text": "The following kinds of hurt only are designated as 'grievous', namely:— (a) Emasculation; (b) [loss of sight]; (c) [loss of hearing]; (d) [loss of limb/joint]; (e) [permanent impairment]; (f) [disfiguration of head/face]; (g) [fracture/dislocation]; (h) [pain for 15 days].",
            "simple": "Lists 8 specific types of severe injuries categorized as 'grievous hurt'."
          },
          {
            "number": "Section 117",
            "text": "(1) Whoever voluntarily causes hurt, if the hurt... is grievous hurt... is said 'voluntarily to cause grievous hurt'. [Punishment: up to 7 years]. (3) [If resulting in permanent disability or vegetative state: 10 years to life]. (4) [Group-based grievous hurt: up to 7 years].",
            "simple": "Punishes causing severe injuries. It introduces life imprisonment for injuries leading to vegetative states and handles mob-based injuries."
          },
          {
            "number": "Section 118",
            "text": "(1) [Hurt caused by dangerous weapons]: up to 3 years. (2) [Grievous hurt caused by dangerous weapons]: life imprisonment or 1 to 10 years.",
            "simple": "Increases penalties for causing hurt or serious injury when using weapons like knives, guns, fire, or poison."
          },
          {
            "number": "Section 119",
            "text": "(1) [Hurt to extort property]: up to 10 years. (2) [Grievous hurt to extort property]: life imprisonment or up to 10 years.",
            "simple": "Punishes injuring someone to force them to give up property or money."
          },
          {
            "number": "Section 120",
            "text": "(1) [Hurt to extort confession/restore property]: up to 7 years. (2) [Grievous hurt for same purpose]: up to 10 years.",
            "simple": "Punishes injuring someone to force a confession or to get stolen property back."
          },
          {
            "number": "Section 121",
            "text": "(1) [Hurt to deter public servant]: up to 5 years. (2) [Grievous hurt to deter public servant]: 1 to 10 years.",
            "simple": "Protects public servants by punishing those who injure them to stop them from doing their job."
          },
          {
            "number": "Section 122",
            "text": "(1) [Hurt on provocation]: up to 1 month. (2) [Grievous hurt on provocation]: up to 5 years.",
            "simple": "Reduces the punishment if the injury was caused by a sudden and grave provocation."
          },
          {
            "number": "Section 123",
            "text": "Whoever administers to or causes to be taken by any person any poison... with intent to cause hurt... shall be punished with imprisonment... which may extend to ten years, and shall also be liable to fine.",
            "simple": "Punishes the act of drugging or poisoning someone with intent to hurt or commit a crime."
          },
          {
            "number": "Section 124",
            "text": "(1) [Acid attack causing permanent injury/vegetative state]: 10 years to life. (2) [Attempt to throw acid]: 5 to 7 years.",
            "simple": "Specific section for acid attacks, providing a minimum of 10 years for actual attacks and up to 7 years for attempts."
          },
          {
            "number": "Section 125",
            "text": "Whoever does any act so rashly or negligently as to endanger human life... [Punishment: 3 months to 3 years depending on if hurt/grievous hurt is caused].",
            "simple": "Punishes reckless behavior that endangers others, even if no death occurs."
          },
          {
            "number": "Section 126",
            "text": "(1) Whoever voluntarily obstructs any person so as to prevent that person from proceeding in any direction in which that person has a right to proceed, is said wrongfully to restrain that person. [Punishment: up to 1 month].",
            "simple": "Defines and punishes blocking someone's path in one specific direction."
          },
          {
            "number": "Section 127",
            "text": "(1) Whoever wrongfully restrains any person in such a manner as to prevent that person from proceedings beyond certain circumscribing limits, is said 'wrongfully to confine' that person. [Punishment ranges from 1 to 5 years depending on duration].",
            "simple": "Defines and punishes trapping someone in a limited space (like a room) so they cannot leave."
          },
          {
            "number": "Section 128",
            "text": "A person is said to use force to another if he causes motion, change of motion, or cessation of motion to that other...",
            "simple": "Provides the technical definition of physical force used against another person."
          },
          {
            "number": "Section 129",
            "text": "Whoever intentionally uses force to any person, without that person's consent, in order to the committing of any offence... is said to use criminal force to that other.",
            "simple": "Defines 'criminal force' as using physical force to commit a crime or cause fear/injury."
          },
          {
            "number": "Section 130",
            "text": "Whoever makes any gesture, or any preparation intending... to cause any person present to apprehend that he... is about to use criminal force... is said to commit an assault.",
            "simple": "Defines assault as a gesture or action that makes someone believe they are about to be hit or touched with criminal force (words alone are not enough)."
          },
          {
            "number": "Section 131",
            "text": "Whoever assaults or uses criminal force to any person otherwise than on grave and sudden provocation... shall be punished with imprisonment... which may extend to three months...",
            "simple": "General punishment for simple assault or use of criminal force."
          },
          {
            "number": "Section 132",
            "text": "Whoever assaults or uses criminal force to any person being a public servant in the execution of his duty... shall be punished with imprisonment... which may extend to two years...",
            "simple": "Punishes assaulting or using force against a public servant on duty."
          },
          {
            "number": "Section 133",
            "text": "Whoever assaults or uses criminal force to any person, intending thereby to dishonour that person... shall be punished with imprisonment... which may extend to two years...",
            "simple": "Punishes using force to humiliate or dishonor someone."
          },
          {
            "number": "Section 134",
            "text": "Whoever assaults or uses criminal force to any person, in attempting to commit theft on any property which that person is then wearing or carrying...",
            "simple": "Punishes using force while trying to steal something from a person's body."
          },
          {
            "number": "Section 135",
            "text": "Whoever assaults or uses criminal force to any person, in attempting wrongfully to confine that person...",
            "simple": "Punishes using force while trying to trap or confine someone."
          },
          {
            "number": "Section 136",
            "text": "Whoever assaults or uses criminal force to any person on grave and sudden provocation... [Punishment: up to 1 month].",
            "simple": "Reduced penalty for assault if provoked."
          },
          {
            "number": "Section 137",
            "text": "(1) Kidnapping is of two kinds: kidnapping from India, and kidnapping from lawful guardianship... [Punishment: up to 7 years].",
            "simple": "Defines kidnapping as taking someone out of India or taking a minor/insane person away from their guardian."
          },
          {
            "number": "Section 138",
            "text": "Whoever by force compels, or by any deceitful means induces, any person to go from any place, is said to abduct that person.",
            "simple": "Defines abduction as forcing or tricking someone into moving from one place to another."
          },
          {
            "number": "Section 139",
            "text": "(1) [Kidnapping for begging]: 10 years to life. (2) [Maiming a child for begging]: 20 years to life.",
            "simple": "Imposes extreme penalties for kidnapping children to use them for begging, especially if they are mutilated."
          },
          {
            "number": "Section 140",
            "text": "(1) [Kidnapping for murder]: life imprisonment or 10 years. (2) [Kidnapping for ransom]: death or life imprisonment.",
            "simple": "Prescribes heavy penalties for kidnapping with intent to kill or for demanding ransom (the latter can carry the death penalty)."
          },
          {
            "number": "Section 141",
            "text": "Whoever imports into India from any country outside India any girl under the age of twenty-one years or any boy under the age of eighteen years with intent that girl or boy may be... forced or seduced to illicit intercourse...",
            "simple": "Punishes the cross-border trafficking of minors for sexual exploitation with up to 10 years."
          },
          {
            "number": "Section 142",
            "text": "Whoever, knowing that any person has been kidnapped or has been abducted, wrongfully conceals or confines such person...",
            "simple": "Punishes hiding a kidnapped person as if you kidnapped them yourself."
          },
          {
            "number": "Section 143",
            "text": "(1) Whoever, for the purpose of exploitation recruits, transports, harbours... by using threats... force... fraud... commits the offence of trafficking. [Punishment ranges from 7 years to natural life].",
            "simple": "Defines human trafficking and provides various punishments based on the number of victims, age of victims, and involvement of public servants."
          },
          {
            "number": "Section 144",
            "text": "(1) [Engaging trafficked child for sexual exploitation]: 5 to 10 years. (2) [Engaging trafficked adult for same]: 3 to 7 years.",
            "simple": "Punishes those who use trafficked persons for sexual acts, with higher penalties if the victim is a child."
          },
          {
            "number": "Section 145",
            "text": "Whoever habitually imports, exports, removes, buys, sells, traffics or deals in slaves, shall be punished with imprisonment for life, or... not exceeding ten years...",
            "simple": "Punishes habitual dealing in slaves."
          },
          {
            "number": "Section 146",
            "text": "Whoever unlawfully compels any person to labour against the will of that person, shall be punished with imprisonment... which may extend to one year...",
            "simple": "Punishes forcing someone to work against their will (forced labor)."
          }
        ]
      },

      {
        "title": "BNS: Chapter VII. Of Offences Against the State",
        "category": "Crimes involving waging war against the government, endangering national sovereignty, and relations with foreign states",
        "jurisdiction": "National",
        "sections": [
            {
                "number": "Section 147",
                "text": "Whoever wages war against the Government of India, or attempts to wage such war, or abets the waging of such war, shall be punished with death or imprisonment for life and shall also be liable to fine.",
                "simple": "The ultimate 'do not do'—waging war against the country or even helping someone else do it is punishable by life in prison or the death penalty."
            },
            {
                "number": "Section 148",
                "text": "Whoever within or without India conspires to commit any of the offences punishable by section 147, or conspires to overawe, by means of criminal force or the show of criminal force, the Central Government or any State Government, shall be punished with imprisonment for life, or with imprisonment of either description which may extend to ten years, and shall also be liable to fine.",
                "simple": "Planning to wage war or using force to intimidate the government is a crime, even if you are just talking about it or planning it from outside India."
            },
            {
                "number": "Section 149",
                "text": "Whoever collects men, arms or ammunition or otherwise prepares to wage war with the intention of either waging or being prepared to wage war against the Government of India, shall be punished with imprisonment for life or imprisonment of either description for a term not exceeding ten years, and shall also be liable to fine.",
                "simple": "Gathering a private army or stockpiling weapons with the intent to fight the government gets you up to 10 years or life in prison."
            },
            {
                "number": "Section 150",
                "text": "Whoever, by any act, or by any illegal omission, conceals the existence of a design to wage war against the Government of India, intending by such concealment to facilitate, or knowing it to be likely that such concealment will facilitate, the waging of such war, shall be punished with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
                "simple": "If you know someone is planning to wage war against the country and you hide that information to help them, you can be jailed for up to 10 years."
            },
            {
                "number": "Section 151",
                "text": "Whoever, with the intention of inducing or compelling the President of India, or the Governor of any State, to exercise or refrain from exercising in any manner any of the lawful powers of such President or Governor, assaults or wrongfully restrains, or attempts wrongfully to restrain, or overawes, by means of criminal force or the show of criminal force, or attempts so to overawe, such President or Governor, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
                "simple": "Assaulting or using force to intimidate the President or a Governor to make them do (or stop doing) their job is punishable by up to 7 years in prison."
            },
            {
                "number": "Section 152",
                "text": "Whoever, purposely or knowingly, by words, either spoken or written, or by signs, or by visible representation, or by electronic communication or by use of financial means, or otherwise, excites or attempts to excite, secession or armed rebellion or subversive activities, or encourages feelings of separatist activities or endangers sovereignty or unity and integrity of India; or indulges in or commits any such act shall be punished with imprisonment for life or with imprisonment which may extend to seven years and shall also be liable to fine.",
                "simple": "This replaces the old sedition law. It punishes anyone who uses words, digital media, or money to incite rebellion, separatism, or activities that threaten the unity and sovereignty of India. The penalty ranges from 7 years to life."
            },
            {
                "number": "Section 153",
                "text": "Whoever wages war against the Government of any foreign State at peace with the Government of India or attempts to wage such war, or abets the waging of such war, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to seven years, to which fine may be added, or with fine.",
                "simple": "You can't use India as a base to wage war against friendly foreign countries. Doing so carries up to a 7-year sentence or life."
            },
            {
                "number": "Section 154",
                "text": "Whoever commits depredation, or makes preparations to commit depredation, on the territories of any foreign State at peace with the Government of India, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine and to forfeiture of any property used or intended to be used in committing such depredation, or acquired by such depredation.",
                "simple": "Raiding or looting the territory of a friendly foreign nation is a crime punishable by 7 years in prison and the loss of any property you stole or used in the raid."
            },
            {
                "number": "Section 155",
                "text": "Whoever receives any property knowing the same to have been taken in the commission of any of the offences mentioned in sections 153 and 154, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine and to forfeiture of the property so received.",
                "simple": "If you take or buy property that you know was looted from a friendly foreign state during a war or raid, you face up to 7 years in prison."
            },
            {
                "number": "Section 156",
                "text": "Whoever, being a public servant and having the custody of any State prisoner or prisoner of war, voluntarily allows such prisoner to escape from any place in which such prisoner is confined, shall be punished with imprisonment for life, or imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
                "simple": "If a government official in charge of a State prisoner or prisoner of war lets them go on purpose, they face 10 years to life in prison."
            },
            {
                "number": "Section 157",
                "text": "Whoever, being a public servant and having the custody of any State prisoner or prisoner of war, negligently suffers such prisoner to escape from any place of confinement in which such prisoner is confined, shall be punished with simple imprisonment for a term which may extend to three years, and shall also be liable to fine.",
                "simple": "If a government official is careless and a State prisoner escapes because of that negligence, the official can be jailed for up to 3 years."
            },
            {
                "number": "Section 158",
                "text": "Whoever knowingly aids or assists any State prisoner or prisoner of war in escaping from lawful custody, or harbours or conceals any such prisoner who has escaped from lawful custody, or offers or attempts to offer any resistance to the recapture of such prisoner, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
                "simple": "Helping a State prisoner escape, hiding them afterward, or trying to stop the police from catching them again is a major crime punishable by up to 10 years or life."
            }
        ]
    },

    {
        "title": "BNS: Chapter VIII. Of Offences Relating to the Army, Navy and Air Force",
        "category": "Crimes involving the encouragement of mutiny, desertion, and insubordination within the armed forces",
        "jurisdiction": "National",
        "sections": [
            {
                "number": "Section 159",
                "text": "Whoever abets the committing of mutiny by an officer, soldier, sailor or airman, in the Army, Navy or Air Force of the Government of India or attempts to seduce any such officer, soldier, sailor or airman from his allegiance or his duty, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
                "simple": "Helping or encouraging a member of the armed forces to mutiny (rebel against authority), or trying to trick them into abandoning their duty, is a major crime punishable by 10 years to life in prison."
            },
            {
                "number": "Section 160",
                "text": "Whoever abets the committing of mutiny by an officer, soldier, sailor or airman, in the Army, Navy or Air Force of the Government of India, shall, if mutiny be committed in consequence of that abetment, be punished with death or with imprisonment for life, or imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
                "simple": "If you encourage a mutiny and it actually happens, you face the most severe penalties, including the death penalty or life imprisonment."
            },
            {
                "number": "Section 161",
                "text": "Whoever abets an assault by an officer, soldier, sailor or airman, in the Army, Navy or Air Force of the Government of India, on any superior officer being in the execution of his office, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
                "simple": "Encouraging a member of the military to attack their superior officer while that officer is on duty is punishable by up to 3 years in prison."
            },
            {
                "number": "Section 162",
                "text": "Whoever abets an assault by an officer, soldier, sailor or airman, in the Army, Navy or Air Force of the Government of India, on any superior officer being in the execution of his office, shall, if such assault be committed in consequence of that abetment be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
                "simple": "If you encourage an attack on a superior officer and the attack actually takes place, your punishment increases to up to 7 years in prison."
            },
            {
                "number": "Section 163",
                "text": "Whoever abets the desertion of any officer, soldier, sailor or airman, in the Army, Navy or Air Force of the Government of India, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
                "simple": "Helping or encouraging a member of the armed forces to desert (run away from) their service is punishable by up to 2 years in prison."
            },
            {
                "number": "Section 164",
                "text": "Whoever, except as hereinafter excepted, knowing or having reason to believe that an officer, soldier, sailor or airman, in the Army, Navy or Air Force of the Government of India, has deserted, harbours such officer, soldier, sailor or airman, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine or with both. Exception.—This provision does not extend to the case in which the harbour is given by the spouse of the deserter.",
                "simple": "Hiding or protecting a military deserter is a crime carrying a 2-year sentence. However, a husband or wife cannot be punished for hiding their deserting spouse."
            },
            {
                "number": "Section 165",
                "text": "The master or person in charge of a merchant vessel, on board of which any deserter from the Army, Navy or Air Force of the Government of India is concealed, shall, though ignorant of such concealment, be liable to a penalty not exceeding three thousand rupees, if he might have known of such concealment but for some neglect of his duty as such master or person in charge, or but for some want of discipline on board of the vessel.",
                "simple": "If a deserter hides on a commercial ship, the captain can be fined up to 3,000 rupees if the hiding was possible because the captain was negligent or failed to keep order on the ship."
            },
            {
                "number": "Section 166",
                "text": "Whoever abets what he knows to be an act of insubordination by an officer, soldier, sailor or airman, in the Army, Navy or Air Force, of the Government of India, shall, if such act of insubordination be committed in consequence of that abetment, be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
                "simple": "Encouraging a soldier to disobey orders is a crime. If they actually disobey because of your encouragement, you can be jailed for up to 2 years."
            },
            {
                "number": "Section 167",
                "text": "No person subject to the Air Force Act, 1950, the Army Act, 1950 and the Navy Act, 1957, or shall be subject to punishment under this Sanhita for any of the offences defined in this Chapter.",
                "simple": "Actual members of the armed forces are not punished under these specific sections of the BNS; they are instead judged by their own military laws (Courts-Martial)."
            },
            {
                "number": "Section 168",
                "text": "Whoever, not being a soldier, sailor or airman in the Army, Naval or Air service of the Government of India, wears any garb or carries any token resembling any garb or token used by such a soldier, sailor or airman with the intention that it may be believed that he is such a soldier, sailor or airman, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to two thousand rupees, or with both.",
                "simple": "It is a crime to dress up in a military uniform or carry military badges to trick people into thinking you are a soldier. The penalty is up to 3 months in jail."
            }
        ]
    },

    {
        "title": "BNS: Chapter IX. Of Offences Relating to Elections",
        "category": "Offences involving bribery, undue influence, personation, and false statements during elections",
        "jurisdiction": "National",
        "sections": [
            {
                "number": "Section 169",
                "text": "For the purposes of this Chapter— (a) \"candidate\" means a person who has been nominated as a candidate at any election; (b) \"electoral right\" means the right of a person to stand, or not to stand as, or to withdraw from being, a candidate or to vote or refrain from voting at an election.",
                "simple": "Defines 'candidate' as anyone nominated for an election and 'electoral right' as the legal right to run for office, withdraw your candidacy, or cast a vote."
            },
            {
                "number": "Section 170",
                "text": "(1) Whoever— (i) gives a gratification to any person with the object of inducing him or any other person to exercise any electoral right or of rewarding any person for having exercised any such right; or (ii) accepts either for himself or for any other person any gratification as a reward for exercising any such right or for inducing or attempting to induce any other person to exercise any such right, commits the offence of bribery: Provided that a declaration of public policy or a promise of public action shall not be an offence under this section. (2) A person who offers, or agrees to give, or offers or attempts to procure, a gratification shall be deemed to give a gratification. (3) A person who obtains or agrees to accept or attempts to obtain a gratification shall be deemed to accept a gratification, and a person who accepts a gratification as a motive for doing what he does not intend to do, or as a reward for doing what he has not done, shall be deemed to have accepted the gratification as a reward.",
                "simple": "Bribery in an election involves giving or receiving rewards to influence how someone uses their right to vote or be a candidate. Official public policy promises are not considered bribes."
            },
            {
                "number": "Section 171",
                "text": "(1) Whoever voluntarily interferes or attempts to interfere with the free exercise of any electoral right commits the offence of undue influence at an election. (2) Without prejudice to the generality of the provisions of sub-section (1), whoever— (a) threatens any candidate or voter, or any person in whom a candidate or voter is interested, with injury of any kind; or (b) induces or attempts to induce a candidate or voter to believe that he or any person in whom he is interested will become or will be rendered an object of Divine displeasure or of spiritual censure, shall be deemed to interfere with the free exercise of the electoral right of such candidate or voter, within the meaning of sub-section (1). (3) A declaration of public policy or a promise of public action or the mere exercise of a legal right without intent to interfere with an electoral right, shall not be deemed to be interference within the meaning of this section.",
                "simple": "It is a crime to interfere with someone's free choice in an election through threats of injury or by claiming they will face 'divine displeasure' or spiritual punishment for their choice."
            },
            {
                "number": "Section 172",
                "text": "Whoever at an election applies for a voting paper or votes in the name of any other person, whether living or dead, or in a fictitious name, or who having voted once at such election applies at the same election for a voting paper in his own name, and whoever abets, procures or attempts to procure the voting by any person in any such way, commits the offence of personation at an election: Provided that nothing in this section shall apply to a person who has been authorised to vote as proxy for an elector under any law for the time being in force in so far as he votes as a proxy for such elector.",
                "simple": "Personation is the crime of voting in someone else's name (whether they are alive, dead, or made up) or trying to vote more than once in the same election. Authorized proxy voting is a legal exception."
            },
            {
                "number": "Section 173",
                "text": "Whoever commits the offence of bribery shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both: Provided that bribery by treating shall be punished with fine only. Explanation.—\"Treating\" means that form of bribery where the gratification consists in food, drink, entertainment, or provision.",
                "simple": "Election bribery is generally punished with up to a year in jail or a fine. If the bribe is simply providing food, drinks, or entertainment ('treating'), the punishment is only a fine."
            },
            {
                "number": "Section 174",
                "text": "Whoever commits the offence of undue influence or personation at an election shall be punished with imprisonment of either description for a term which may extend to one year or with fine, or with both.",
                "simple": "Using illegal influence or faking your identity to vote is punishable by up to one year in prison, a fine, or both."
            },
            {
                "number": "Section 175",
                "text": "Whoever with intent to affect the result of an election makes or publishes any statement purporting to be a statement of fact which is false and which he either knows or believes to be false or does not believe to be true, in relation to the personal character or conduct of any candidate shall be punished with fine.",
                "simple": "Lying about a candidate's personal character or conduct to change the election outcome is a crime punishable by a fine."
            },
            {
                "number": "Section 176",
                "text": "Whoever without the general or special authority in writing of a candidate incurs or authorises expenses on account of the holding of any public meeting, or upon any advertisement, circular or publication, or in any other way whatsoever for the purpose of promoting or procuring the election of such candidate, shall be punished with fine which may extend to ten thousand rupees: Provided that if any person having incurred any such expenses not exceeding the amount of ten rupees without authority obtains within ten days from the date on which such expenses were incurred the approval in writing of the candidate, he shall be deemed to have incurred such expenses with the authority of the candidate.",
                "simple": "Spending money on a candidate's campaign (like for ads or meetings) without their written permission is illegal and punishable by a fine of up to 10,000 rupees. Very small costs (under 10 rupees) can be approved after the fact."
            },
            {
                "number": "Section 177",
                "text": "Whoever being required by any law for the time being in force or any rule having the force of law to keep accounts of expenses incurred at or in connection with an election fails to keep such accounts shall be punished with fine which may extend to five thousand rupees.",
                "simple": "If you are legally required to keep records of election spending and fail to do so, you can be fined up to 5,000 rupees."
            }
        ]
    },

    {
        "title": "BNS: Chapter X. Of Offences Relating to Coin, Currency-Notes, Bank-Notes, and Government Stamps",
        "category": "Crimes involving the forgery, counterfeiting, and illegal possession of money and government revenue or postage stamps",
        "jurisdiction": "National",
        "sections": [
            {
                "number": "Section 178",
                "text": "Whoever counterfeits, or knowingly performs any part of the process of counterfeiting, any coin, stamp issued by Government for the purpose of revenue, currency-note or bank-note, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
                "simple": "Making fake money, coins, or government revenue stamps, or even performing just one part of the manufacturing process, is a serious crime punishable by life imprisonment or up to 10 years in jail."
            },
            {
                "number": "Section 179",
                "text": "Whoever imports or exports, or sells or delivers to, or buys or receives from, any other person, or otherwise traffics or uses as genuine, any forged or counterfeit coin, stamp, currency-note or bank-note, knowing or having reason to believe the same to be forged or counterfeit, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
                "simple": "It is a major crime to trade, buy, sell, import, export, or attempt to spend fake money or government stamps if you know they are forgeries."
            },
            {
                "number": "Section 180",
                "text": "Whoever has in his possession any forged or counterfeit coin, stamp, currency-note or bank-note, knowing or having reason to believe the same to be forged or counterfeit and intending to use the same as genuine or that it may be used as genuine, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both. Explanation.—If a person establishes the possession of the forged or counterfeit coin, stamp, currency-note or bank-note to be from a lawful source, it shall not constitute an offence under this section.",
                "simple": "Possessing fake money or stamps with the intent to use them is punishable by up to 7 years in jail. You are not guilty if you can prove you obtained them from a legitimate source without knowing they were fake."
            },
            {
                "number": "Section 181",
                "text": "Whoever makes or mends, or performs any part of the process of making or mending, or buys or sells or disposes of, or has in his possession, any machinery, die, or instrument or material for the purpose of being used, or knowing or having reason to believe that it is intended to be used, for forging or counterfeiting any coin, stamp issued by Government for the purpose of revenue, currency-note or bank-note, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
                "simple": "Owning, making, or selling tools, machinery, or materials intended for forging money or government stamps carries heavy penalties, including life imprisonment."
            },
            {
                "number": "Section 182",
                "text": "(1) Whoever makes, or causes to be made, or uses for any purpose whatsoever, or delivers to any person, any document purporting to be, or in any way resembling, or so nearly resembling as to be calculated to deceive, any currency-note or bank-note shall be punished with fine which may extend to three hundred rupees. (2) If any person, whose name appears on a document the making of which is an offence under sub-section (1), refuses, without lawful excuse, to disclose to a police officer on being so required the name and address of the person by whom it was printed or otherwise made, he shall be punished with fine which may extend to six hundred rupees. (3) Where the name of any person appears on any document in respect of which any person is charged with an offence under sub-section (1) or on any other document used or distributed in connection with that document it may, until the contrary is proved, be presumed that the person caused the document to be made.",
                "simple": "It is illegal to create documents that look like real currency to deceive people. While the fine is small, refusing to identify the printer to the police results in a higher fine. The law presumes the person named on the document made it."
            },
            {
                "number": "Section 183",
                "text": "Whoever, fraudulently or with intent to cause loss to the Government, removes or effaces from any substance, bearing any stamp issued by Government for the purpose of revenue, any writing or document for which such stamp has been used, or removes from any writing or document a stamp which has been used for such writing or document, in order that such stamp may be used for a different writing or document, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
                "simple": "Washing off old writing from a used government revenue stamp or removing it from an old document to reuse it is a crime punishable by up to 3 years."
            },
            {
                "number": "Section 184",
                "text": "Whoever, fraudulently or with intent to cause loss to the Government, uses for any purpose a stamp issued by Government for the purpose of revenue, which he knows to have been before used, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
                "simple": "Knowingly using a government revenue stamp that has already been used is punishable by up to 2 years in prison."
            },
            {
                "number": "Section 185",
                "text": "Whoever, fraudulently or with intent to cause loss to Government, erases or removes from a stamp issued by Government for the purpose of revenue, any mark, put or impressed upon such stamp for the purpose of denoting that the same has been used, or knowingly has in his possession or sells or disposes of any such stamp from which such mark has been erased or removed, or sells or disposes of any such stamp which he knows to have been used, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
                "simple": "Removing the 'used' mark from a revenue stamp, or possessing and selling stamps that have been tampered with in this way, can lead to 3 years in jail."
            },
            {
                "number": "Section 186",
                "text": "(1) Whoever— (a) makes, knowingly utters, deals in or sells any fictitious stamp, or knowingly uses for any postal purpose any fictitious stamp; or (b) has in his possession, without lawful excuse, any fictitious stamp; or (c) makes or, without lawful excuse, has in his possession any die, plate, instrument or materials for making any fictitious stamp, shall be punished with fine which may extend to two hundred rupees. (2) Any such stamp, die, plate, instrument or materials in the possession of any person for making any fictitious stamp may be seized and, if seized shall be forfeited. (3) In this section \"fictitious stamp\" means any stamp falsely purporting to be issued by Government for the purpose of denoting a rate of postage, or any facsimile or imitation or representation, whether on paper or otherwise, of any stamp issued by Government for that purpose.",
                "simple": "Making, using, or selling fake postage stamps (stamps for mail) is illegal and punishable by a fine. The fake stamps and tools to make them will be confiscated by the state."
            },
            {
                "number": "Section 187",
                "text": "Whoever, being employed in any mint lawfully established in India, does any act, or omits what he is legally bound to do, with the intention of causing any coin issued from that mint to be of a different weight or composition from the weight or composition fixed by law, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
                "simple": "If an employee at a government mint purposely makes coins that are the wrong weight or composed of the wrong materials, they face up to 7 years in prison."
            },
            {
                "number": "Section 188",
                "text": "Whoever, without lawful authority, takes out of any mint, lawfully established in India, any coining tool or instrument, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
                "simple": "Stealing tools or instruments used to make coins from a government mint is a crime punishable by up to 7 years."
            }
        ]
    },

    {
        "title": "BNS: Chapter XI. Of Offences Against the Public Tranquillity",
        "category": "Offences involving unlawful assembly, rioting, and acts that disturb public peace and harmony",
        "jurisdiction": "National",
        "sections": [
            {
                "number": "Section 189",
                "text": "(1) An assembly of five or more persons is designated an \"unlawful assembly\", if the common object of the persons composing that assembly is— (a) to overawe by criminal force, or show of criminal force, the Central Government or any State Government or Parliament or the Legislature of any State, or any public servant in the exercise of the lawful power of such public servant; or (b) to resist the execution of any law, or of any legal process; or (c) to commit any mischief or criminal trespass, or other offence; or (d) by means of criminal force, or show of criminal force, to any person, to take or obtain possession of any property, or to deprive any person of the enjoyment of a right of way, or of the use of water or other incorporeal right of which he is in possession or enjoyment, or to enforce any right or supposed right; or (e) by means of criminal force, or show of criminal force, to compel any person to do what he is not legally bound to do, or to omit to do what he is legally entitled to do. (2) Whoever, being aware of facts which render any assembly an unlawful assembly, intentionally joins that assembly, or continues in it, is said to be a member of an unlawful assembly.",
                "simple": "An unlawful assembly is a group of five or more people whose shared goal is to intimidate the government, break the law, commit a crime, seize property by force, or force someone to do something against their will. Simply joining such a group while knowing its illegal purpose makes you a member."
            },
            {
                "number": "Section 190",
                "text": "If an offence is committed by any member of an unlawful assembly in prosecution of the common object of that assembly, or such as the members of that assembly knew to be likely to be committed in prosecution of that object, every person who, at the time of the committing of that offence, is a member of the same assembly, is guilty of that offence.",
                "simple": "If one person in an unlawful assembly commits a crime to achieve the group's goal, every single member of that group is held legally responsible for that crime, even if they didn't personally commit the act."
            },
            {
                "number": "Section 191",
                "text": "(1) Whoever is a member of an unlawful assembly shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both. (2) Whoever joins or continues in an unlawful assembly, knowing that such unlawful assembly has been commanded in the manner prescribed by law to disperse, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both. (3) Whoever is a member of an unlawful assembly, shall, if he is armed with any deadly weapon, or with anything which, used as a weapon of offence, is likely to cause death, be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
                "simple": "Basic membership in an unlawful assembly can lead to 6 months in jail. If you stay after being ordered by authorities to leave, or if you show up with a deadly weapon, the punishment increases to up to 2 years."
            },
            {
                "number": "Section 192",
                "text": "Whoever, being a member of an unlawful assembly, is guilty of rioting, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
                "simple": "If an unlawful assembly starts using actual force or violence, it becomes 'rioting,' and members can be jailed for up to 2 years."
            },
            {
                "number": "Section 193",
                "text": "Whoever is guilty of rioting, being armed with a deadly weapon or with anything which, used as a weapon of offence, is likely to cause death, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
                "simple": "If you participate in a riot while carrying a deadly weapon, you face a harsher penalty of up to 3 years in prison."
            },
            {
                "number": "Section 194",
                "text": "Whoever, by force, threat, or any other means, obstructs or attempts to obstruct any officer or other person in the exercise of his duty to disperse an unlawful assembly or to suppress a riot or affray, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
                "simple": "Trying to stop the police or authorities from breaking up an unlawful assembly or a riot is a crime punishable by up to 3 years in jail."
            },
            {
                "number": "Section 195",
                "text": "When two or more persons, by fighting in a public place, disturb the public peace, they are said to 'commit an affray'. Whoever commits an affray shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both.",
                "simple": "An 'affray' is a public fight between two or more people that disturbs the peace. It is punishable by up to one month in jail or a 5,000 rupee fine."
            },
            {
                "number": "Section 196",
                "text": "(1) Whoever— (a) by words, either spoken or written, or by signs or by visible representations or through electronic communication or otherwise, promotes or attempts to promote, on grounds of religion, race, place of birth, residence, language, caste or community or any other ground whatsoever, disharmony or feelings of enmity, hatred or ill-will between different religious, racial, language or regional groups or castes or communities; or (b) commits any act which is prejudicial to the maintenance of harmony... shall be punished with imprisonment which may extend to three years, or with fine, or with both. (2) [Punishment increases to 5 years if the act is committed in a place of worship].",
                "simple": "This section punishes hate speech and acts that stir up hatred or enmity between different religious, racial, or regional groups. The punishment is up to 3 years, increasing to 5 years if done in a place of worship."
            },
            {
                "number": "Section 197",
                "text": "(1) Whoever, by words either spoken or written, or by signs or by visible representations or through electronic communication or otherwise,— (a) makes or publishes any imputation that any class of persons cannot, by reason of their being members of any religious, racial, language or regional group or caste or community, bear true allegiance to the Constitution of India as by law established or uphold the sovereignty and integrity of India; or (b) [claims that groups should be denied their rights as citizens]... shall be punished with imprisonment which may extend to three years, or with fine, or with both.",
                "simple": "It is a crime to make public claims that certain groups (based on religion, race, etc.) are unpatriotic, cannot follow the Constitution, or should be denied their rights as citizens. This is considered a threat to national integration."
            }
        ]
    },

    {
        "title": "BNS: Chapter XII. Of Offences By or Relating to Public Servants",
        "category": "Crimes committed by public servants through illegal conduct and the misuse of authority, and crimes involving the personation of officials.",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 198",
            "text": "Whoever, being a public servant, knowingly disobeys any direction of the law as to the way in which he is to conduct himself as such public servant, intending to cause, or knowing it to be likely that he will by such disobedience, cause injury to any person, shall be punished with simple imprisonment for a term which may extend to one year, or with fine, or with both.",
            "simple": "If a government official intentionally ignores the law regarding how they should do their job in order to harm someone, they can be jailed for up to a year or fined."
          },
          {
            "number": "Section 199",
            "text": "Whoever, being a public servant,- (a) knowingly disobeys any direction of the law which prohibits him from requiring the attendance at any place of any person for the purpose of investigation into an offence or any other matter, or (b) knowingly disobeys, to the prejudice of any person, any other direction of the law regulating the manner in which he shall conduct such investigation; or (c) fails to record any information given to him under sub-section (1) of section 173 of the Bharatiya Nagarik Suraksha Sanhita, 2023 in relation to cognizable offence punishable under section 64, section 65, section 66, section 67, section 68, section 70, section 71, section 74, section 76, section 77, section 79, section 124, section 143 or section 144, shall be punished with rigorous imprisonment for a term which shall not be less than six months but which may extend to two years, and shall also be liable to fine.",
            "simple": "This section punishes public servants who break specific rules during investigations, such as forcing someone to appear illegally or refusing to file reports for serious crimes like sexual assault. The punishment is between six months and two years in prison."
          },
          {
            "number": "Section 200",
            "text": "Whoever, being in charge of a hospital, public or private, whether run by the Central Government, the State Government, local bodies or any other person, contravenes the provisions of section 397 of the Bharatiya Nagarik Suraksha Sanhita, 2023, shall be punished with imprisonment for a term which may extend to one year, or with fine, or with both.",
            "simple": "A person in charge of any hospital (government or private) who refuses to provide required treatment to a victim can be sentenced to up to one year in prison."
          },
          {
            "number": "Section 201",
            "text": "Whoever, being a public servant, and being, as such public servant, charged with the preparation or translation of any document or electronic record, frames, prepares or translates that document or electronic record in a manner which he knows or believes to be incorrect, intending thereby to cause or knowing it to be likely that he may thereby cause injury to any person, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
            "simple": "If a public servant tasked with creating or translating a document purposely makes it incorrect to hurt someone, they face up to three years in prison."
          },
          {
            "number": "Section 202",
            "text": "Whoever, being a public servant, and being legally bound as such public servant not to engage in trade, engages in trade, shall be punished with simple imprisonment for a term which may extend to one year, or with fine, or with both or with community service.",
            "simple": "A public servant who is legally forbidden from doing business but does it anyway can be jailed for up to a year or assigned community service."
          },
          {
            "number": "Section 203",
            "text": "Whoever, being a public servant, and being legally bound as such public servant, not to purchase or bid for certain property, purchases or bids for that property, either in his own name or in the name of another, or jointly, or in shares with others, shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both; and the property, if purchased, shall be confiscated.",
            "simple": "A public servant who is legally banned from buying or bidding on certain properties (like those they are selling officially) but does so anyway faces up to two years in jail and loses the property."
          },
          {
            "number": "Section 204",
            "text": "Whoever pretends to hold any particular office as a public servant, knowing that he does not hold such office or falsely personates any other person holding such office, and in such assumed character does or attempts to do any act under colour of such office, shall be punished with imprisonment of either description for a term which shall not be less than six months but which may extend to three years and with fine.",
            "simple": "Pretending to be a public official (like a policeman or tax officer) and trying to perform official acts in that false identity is a crime punishable by six months to three years in prison."
          },
          {
            "number": "Section 205",
            "text": "Whoever, not belonging to a certain class of public servants, wears any garb or carries any token resembling any garb or token used by that class of public servants, with the intention that it may be believed, or with the knowledge that it is likely to be believed, that he belongs to that class of public servants, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Wearing a uniform or carrying symbols (like a badge) of a public official to trick people into thinking you are one is illegal and can lead to a three-month prison sentence or a fine."
          }
        ]
    },

    {
        "title": "BNS: Chapter XIII. Of Contempts of the Lawful Authority of Public Servants",
        "category": "Offences involving the disobedience of legal orders, summons, and the obstruction of public servants in their official duties.",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 206",
            "text": "Whoever absconds in order to avoid being served with a summons, notice or order proceeding from any public servant legally competent, as such public servant, to issue such summons, notice or order,-(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both; (b) where such summons or notice or order is to attend in person or by agent, or to produce a document or an electronic record in a Court shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both.",
            "simple": "Hiding or running away to avoid receiving a legal notice or summons from a public official is a crime. The penalty is more severe (up to six months) if the notice was specifically for a court appearance or to provide evidence."
          },
          {
            "number": "Section 207",
            "text": "Whoever in any manner intentionally prevents the serving on himself, or on any other person, of any summons, notice or order proceeding from any public servant legally competent, as such public servant, to issue such summons, notice or order, or intentionally prevents the lawful affixing to any place of any such summons, notice or order or intentionally removes any such summons, notice or order from any place to which it is lawfully affixed or intentionally prevents the lawful making of any proclamation, under the authority of any public servant legally competent, as such public servant, to direct such proclamation to be made,-(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both; (b) where the summons, notice, order or proclamation is to attend in person or by agent, or to produce a document or electronic record in a Court, with simple imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both.",
            "simple": "Intentionally stopping a legal notice from being delivered, tearing down a legally posted notice, or preventing a public announcement is illegal. Penalties increase if the order involved a court matter."
          },
          {
            "number": "Section 208",
            "text": "Whoever, being legally bound to attend in person or by an agent at a certain place and time in obedience to a summons, notice, order, or proclamation proceeding from any public servant legally competent, as such public servant, to issue the same, intentionally omits to attend at that place or time or departs from the place where he is bound to attend before the time at which it is lawful for him to depart,-(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both; (b) where the summons, notice, order or proclamation is to attend in person or by agent in a Court with simple imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both.",
            "simple": "If you are legally required to show up at a specific time and place for an official reason and you intentionally don't go or leave early without permission, you can be jailed or fined."
          },
          {
            "number": "Section 209",
            "text": "Whoever fails to appear at the specified place and the specified time as required by a proclamation published under sub-section (1) of section 84 of the Bharatiya Nagarik Suraksha Sanhita, 2023, shall be punished with imprisonment for a term which may extend to three years, or with fine, or with both, or with community service, and where a declaration has been made under sub-section (4) of that section pronouncing him as a proclaimed offender, he shall be punished with imprisonment for a term which may extend to seven years and shall also be liable to fine.",
            "simple": "Failing to appear when you have been officially declared a 'proclaimed offender' is a major crime. You can face up to three years in prison generally, or up to seven years if the court has officially designated you as a fugitive."
          },
          {
            "number": "Section 210",
            "text": "Whoever, being legally bound to produce or deliver up any document or electronic record to any public servant, as such, intentionally omits so to produce or deliver up the same,-(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both; (b) and where the document or electronic record is to be produced or delivered up to a Court with simple imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both.",
            "simple": "If the law requires you to hand over a document or digital file to an official and you refuse to do so, you can be punished with jail time or a fine."
          },
          {
            "number": "Section 211",
            "text": "Whoever, being legally bound to give any notice or to furnish information on any subject to any public servant, as such, intentionally omits to give such notice or to furnish such information in the manner and at the time required by law,-(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both; (b) where the notice or information required to be given respects the commission of an offence, or is required for the purpose of preventing the commission of an offence, or in order to the apprehension of an offender, with simple imprisonment for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both; (c) where the notice or information required to be given is required by an order passed under section 394 of the Bharatiya Nagarik Suraksha Sanhita, 2023 with imprisonment of either description for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both.",
            "simple": "Intentionally failing to provide information to the authorities when the law requires you to—especially information about a crime or to help catch a criminal—is punishable by up to six months in jail."
          },
          {
            "number": "Section 212",
            "text": "Whoever, being legally bound to furnish information on any subject to any public servant, as such, furnishes, as true, information on the subject which he knows or has reason to believe to be false, (a) shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both; (b) where the information which he is legally bound to give respects the commission of an offence, or is required for the purpose of preventing the commission of an offence, or in order to the apprehension of an offender, with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
            "simple": "Lying to a public official when you are legally required to tell the truth is a crime. If the lie is about a crime, the penalty can be up to two years in prison."
          },
          {
            "number": "Section 213",
            "text": "Whoever refuses to bind himself by an oath or affirmation to state the truth, when required so to bind himself by a public servant legally competent to require that he shall so bind himself, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "If an official has the legal right to make you swear or promise to tell the truth and you refuse to take that oath, you can be jailed for up to six months."
          },
          {
            "number": "Section 214",
            "text": "Whoever, being legally bound to state the truth on any subject to any public servant, refuses to answer any question demanded of him touching that subject by such public servant in the exercise of the legal powers of such public servant, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Refusing to answer questions from a public official who has the legal authority to ask them is punishable by a six-month jail sentence or a fine."
          },
          {
            "number": "Section 215",
            "text": "Whoever refuses to sign any statement made by him, when required to sign that statement by a public servant legally competent to require that he shall sign that statement, shall be punished with simple imprisonment for a term which may extend to three months, or with fine which may extend to three thousand rupees, or with both.",
            "simple": "If you give a statement to a public official and then refuse to sign it when legally required to do so, you can be jailed for three months."
          },
          {
            "number": "Section 216",
            "text": "Whoever, being legally bound by an oath or affirmation to state the truth on any subject to any public servant or other person authorised by law to administer such oath or affirmation, makes, to such public servant or other person as aforesaid, touching that subject, any statement which is false, and which he either knows or believes to be false or does not believe to be true, shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
            "simple": "Lying under oath to a public official or authorized person is a serious offence carrying a punishment of up to three years in prison."
          },
          {
            "number": "Section 217",
            "text": "Whoever gives to any public servant any information which he knows or believes to be false, intending thereby to cause, or knowing it to be likely that he will thereby cause, such public servant- (a) to do or omit anything which such public servant ought not to do or omit if the true state of facts respecting which such information is given were known by him; or (b) to use the lawful power of such public servant to the injury or annoyance of any person, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to ten thousand rupees, or with both.",
            "simple": "Giving false information to a public official to trick them into using their power to hurt or annoy someone else is punishable by up to a year in prison."
          },
          {
            "number": "Section 218",
            "text": "Whoever offers any resistance to the taking of any property by the lawful authority of any public servant, knowing or having reason to believe that he is such public servant, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to ten thousand rupees, or with both.",
            "simple": "Resisting a public official who is legally authorized to seize or take property is a crime punishable by six months in jail."
          },
          {
            "number": "Section 219",
            "text": "Whoever intentionally obstructs any sale of property offered for sale by the lawful authority of any public servant, as such, shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Trying to stop or block a legal public auction or sale conducted by the government is punishable by one month in jail."
          },
          {
            "number": "Section 220",
            "text": "Whoever, at any sale of property held by the lawful authority of a public servant, as such, purchases or bids for any property on account of any person, whether himself or any other, whom he knows to be under a legal incapacity to purchase that property at that sale, or bids for such property not intending to perform the obligations under which he lays himself by such bidding, shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to two hundred rupees, or with both.",
            "simple": "It is illegal to make fake bids at a government sale or to buy property on behalf of someone who is legally banned from doing so."
          },
          {
            "number": "Section 221",
            "text": "Whoever voluntarily obstructs any public servant in the discharge of his public functions, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to two thousand and five hundred rupees, or with both.",
            "simple": "Intentionally getting in the way of a public official while they are doing their job is punishable by up to three months in jail."
          },
          {
            "number": "Section 222",
            "text": "Whoever, being bound by law to render or furnish assistance to any public servant in the execution of his public duty, intentionally omits to give such assistance,-(a) shall be punished with simple imprisonment for a term which may extend to one month, or with fine which may extend to two thousand and five hundred rupees, or with both; (b) and where such assistance be demanded of him by a public servant legally competent to make such demand for the purposes of executing any process lawfully issued by a Court or of preventing the commission of an offence, or suppressing a riot, or affray, or of apprehending a person charged with or guilty of an offence, or of having escaped from lawful custody, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "If the law says you must help an official (like helping a policeman stop a riot or catch a criminal) and you refuse to do so, you can be jailed for up to six months."
          },
          {
            "number": "Section 223",
            "text": "Whoever, knowing that, by an order promulgated by a public servant lawfully empowered to promulgate such order, he is directed to abstain from a certain act, or to take certain order with certain property in his possession or under his management, disobeys such direction,-(a) shall, if such disobedience causes or tends to cause obstruction, annoyance or injury, or risk of obstruction, annoyance or injury, to any person lawfully employed, be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to two thousand and five hundred rupees, or with both; (b) and where such disobedience causes or tends to cause danger to human life, health or safety, or causes or tends to cause a riot or affray, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Breaking an official public order (like an order to stop a noisy protest or stay out of a restricted area) is a crime. If the disobedience creates a danger to life or causes a riot, the punishment increases to one year in prison."
          },
          {
            "number": "Section 224",
            "text": "Whoever holds out any threat of injury to any public servant, or to any person in whom he believes that public servant to be interested, for the purpose of inducing that public servant to do any act, or to forbear or delay to do any act, connected with the exercise of the public functions of such public servant, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
            "simple": "Threatening a public official (or their family) to make them do something they shouldn't, or to stop them from doing their duty, is punishable by up to two years in prison."
          },
          {
            "number": "Section 225",
            "text": "Whoever holds out any threat of injury to any person for the purpose of inducing that person to refrain or desist from making a legal application for protection against any injury to any public servant legally empowered as such to give such protection, or to cause such protection to be given, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.",
            "simple": "Threatening someone to stop them from asking the government for protection or help is a crime punishable by up to one year in jail."
          },
          {
            "number": "Section 226",
            "text": "Whoever attempts to commit suicide with the intent to compel or restrain any public servant from discharging his official duty shall be punished with simple imprisonment for a term which may extend to one year, or with fine, or with both, or with community service.",
            "simple": "Using a suicide attempt as a way to blackmail or pressure a public official into doing (or not doing) their job is a crime punishable by up to one year in prison or community service."
          }
        ]
    },

    {
        "title": "BNS: Chapter XIV. Of False Evidence and Offences Against Public Justice",
        "category": "Offences involving perjury, fabrication of evidence, screening of offenders, and resisting legal processes.",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 227",
            "text": "Whoever, being legally bound by an oath or by an express provision of law to state the truth, or being bound by law to make a declaration upon any subject, makes any statement which is false, and which he either knows or believes to be false or does not believe to be true, is said to give false evidence.",
            "simple": "Committing perjury: If you are legally required to tell the truth (like under oath) and you lie, you are guilty of giving false evidence."
          },
          {
            "number": "Section 228",
            "text": "Whoever causes any circumstance to exist or makes any false entry in any book or record, or electronic record or makes any document or electronic record containing a false statement, intending that such circumstance, false entry or false statement may appear in evidence in a judicial proceeding... is said 'to fabricate false evidence'.",
            "simple": "Faking evidence: This involves creating false records or planting evidence to trick a court or official into making a wrong decision."
          },
          {
            "number": "Section 229",
            "text": "(1) Whoever intentionally gives false evidence in any stage of a judicial proceeding, or fabricates false evidence... shall be punished with imprisonment... which may extend to seven years, and shall also be liable to fine... (2) [Other cases: up to three years].",
            "simple": "General punishment for lying in court or faking evidence is up to seven years in prison. In non-court matters, the punishment is up to three years."
          },
          {
            "number": "Section 230",
            "text": "(1) Whoever gives or fabricates false evidence, intending thereby to cause... any person to be convicted of an offence which is capital... shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years... (2) If an innocent person be convicted and executed... [punishment is death or life imprisonment].",
            "simple": "If you lie to get someone sentenced to death, you face life in prison. If your lie actually causes an innocent person to be executed, you can be sentenced to death yourself."
          },
          {
            "number": "Section 231",
            "text": "Whoever gives or fabricates false evidence intending thereby to cause... any person to be convicted of an offence which... is not capital, but punishable with imprisonment for life, or... seven years or upwards, shall be punished as a person convicted of that offence would be liable to be punished.",
            "simple": "If you lie to get someone convicted of a serious crime (punishable by 7+ years or life), you will receive the same punishment that the innocent person would have faced."
          },
          {
            "number": "Section 232",
            "text": "(1) Whoever threatens another... with intent to cause that person to give false evidence shall be punished with imprisonment... which may extend to seven years... (2) If [an] innocent person is convicted... [of a serious crime], the person who threatens shall be punished with the same punishment.",
            "simple": "Blackmailing or threatening someone to force them to lie in court is punishable by up to seven years. If your threat leads to an innocent person being wrongly convicted of a major crime, you get their sentence."
          },
          {
            "number": "Section 233",
            "text": "Whoever corruptly uses or attempts to use as true or genuine evidence any evidence which he knows to be false or fabricated, shall be punished in the same manner as if he gave or fabricated false evidence.",
            "simple": "Knowingly using fake evidence in court is punished exactly the same as if you had created the fake evidence yourself."
          },
          {
            "number": "Section 234",
            "text": "Whoever issues or signs any certificate required by law... knowing or believing that such certificate is false in any material point, shall be punished in the same manner as if he gave false evidence.",
            "simple": "Signing or issuing a legally required certificate (like a medical or fitness certificate) knowing it contains lies is treated as perjury."
          },
          {
            "number": "Section 235",
            "text": "Whoever corruptly uses or attempts to use any such certificate as a true certificate, knowing the same to be false... shall be punished in the same manner as if he gave false evidence.",
            "simple": "Using a false certificate as if it were real carries the same penalty as lying under oath."
          },
          {
            "number": "Section 236",
            "text": "Whoever, in any declaration made or subscribed by him, which declaration any Court or any public servant... is bound or authorised by law to receive as evidence... makes any statement which is false... shall be punished in the same manner as if he gave false evidence.",
            "simple": "Making a false statement in a formal legal declaration is the same as lying in court."
          },
          {
            "number": "Section 237",
            "text": "Whoever corruptly uses or attempts to use as true any such declaration, knowing the same to be false... shall be punished in the same manner as if he gave false evidence.",
            "simple": "Using a false legal declaration as if it were true is a crime equivalent to perjury."
          },
          {
            "number": "Section 238",
            "text": "Whoever... causes any evidence of the commission of [an] offence to disappear, with the intention of screening the offender... or gives any information... which he knows or believes to be false [shall be punished with up to seven years, three years, or 1/4th of the offender's term depending on the crime].",
            "simple": "Destroying evidence or lying to the police to protect a criminal from being caught is a crime. The heavier the criminal's crime, the heavier your punishment for helping them hide."
          },
          {
            "number": "Section 239",
            "text": "Whoever... intentionally omits to give any information respecting that offence which he is legally bound to give, shall be punished with imprisonment... which may extend to six months, or with fine... or with both.",
            "simple": "If you are legally required to report a crime and you intentionally stay silent, you can be jailed for six months."
          },
          {
            "number": "Section 240",
            "text": "Whoever... gives any information respecting that offence which he knows or believes to be false, shall be punished with imprisonment... which may extend to two years, or with fine, or with both.",
            "simple": "Knowingly giving the police false information about a crime is punishable by up to two years in prison."
          },
          {
            "number": "Section 241",
            "text": "Whoever secretes or destroys any document or electronic record which he may be lawfully compelled to produce as evidence... with the intention of preventing the same from being produced... shall be punished with imprisonment... which may extend to three years, or with fine... or with both.",
            "simple": "Hiding or destroying documents or digital records to keep them from being used as evidence in court is punishable by up to three years in jail."
          },
          {
            "number": "Section 242",
            "text": "Whoever falsely personates another, and in such assumed character makes any admission or statement... or does any other act in any suit or criminal prosecution, shall be punished with imprisonment... which may extend to three years, or with fine, or with both.",
            "simple": "Pretending to be someone else during a legal case or court proceeding is a crime punishable by up to three years."
          },
          {
            "number": "Section 243",
            "text": "Whoever fraudulently removes, conceals, transfers or delivers to any person any property... intending thereby to prevent that property... from being taken as a forfeiture or in satisfaction of a fine... shall be punished with imprisonment... which may extend to three years, or with fine... or with both.",
            "simple": "Hiding your property so the court can't seize it to pay a fine or as a penalty is punishable by up to three years."
          },
          {
            "number": "Section 244",
            "text": "Whoever fraudulently accepts, receives or claims any property... knowing that he has no right... intending thereby to prevent that property... from being taken as a forfeiture or in satisfaction of a fine... shall be punished with imprisonment... which may extend to two years, or with fine, or with both.",
            "simple": "Faking a claim to property just to stop the court from seizing it is illegal and carries up to a two-year sentence."
          },
          {
            "number": "Section 245",
            "text": "Whoever fraudulently causes or suffers a decree or order to be passed against him at the suit of any person for a sum not due... or for any property... to which such person is not entitled... shall be punished with imprisonment... which may extend to two years, or with fine, or with both.",
            "simple": "Purposely letting someone win a fake court case against you to hide your money or assets is punishable by two years in jail."
          },
          {
            "number": "Section 246",
            "text": "Whoever fraudulently or dishonestly... makes in a Court any claim which he knows to be false, shall be punished with imprisonment... which may extend to two years, and shall also be liable to fine.",
            "simple": "Making a completely false claim in court to trick the judge is punishable by up to two years in prison."
          },
          {
            "number": "Section 247",
            "text": "Whoever fraudulently obtains a decree or order against any person for a sum not due... or for anything in respect of which it has been satisfied... shall be punished with imprisonment... which may extend to two years, or with fine, or with both.",
            "simple": "Tricking a court into giving you a judgment for money you aren't actually owed is a crime."
          },
          {
            "number": "Section 248",
            "text": "Whoever, with intent to cause injury to any person, institutes... any criminal proceeding against that person, or falsely charges any person with having committed an offence, knowing that there is no just or lawful ground... [punishment up to five years, or ten years for serious charges].",
            "simple": "Filing a false police report or court case against someone just to hurt them is a major crime. You face up to five years generally, or up to ten years if you falsely accused them of a very serious crime."
          },
          {
            "number": "Section 249",
            "text": "Whenever an offence has been committed, whoever harbours or conceals a person whom he knows... to be the offender, with the intention of screening him from legal punishment... [punishment varies from 1/4th of the offender's term to five years]. Exception.—[Does not apply to spouses].",
            "simple": "Hiding a criminal to help them escape justice is a crime. The penalty depends on how serious the criminal's original crime was. Husbands and wives are exempt from this specific rule."
          },
          {
            "number": "Section 250",
            "text": "Whoever accepts... any gratification... in consideration of his concealing an offence or of his screening any person from legal punishment... [punishment varies based on the crime].",
            "simple": "Taking a bribe to hide a crime or protect a criminal from the law is punishable by prison time."
          },
          {
            "number": "Section 251",
            "text": "Whoever gives... any gratification... in consideration of that person's concealing an offence... [punishment varies]. Exception.—[Does not apply to compoundable offences].",
            "simple": "Offering a bribe to someone so they will help you hide a crime or escape punishment is a crime."
          },
          {
            "number": "Section 252",
            "text": "Whoever takes... any gratification under pretence... of helping any person to recover any movable property of which he shall have been deprived by any offence... shall, unless he uses all means... to cause the offender to be apprehended... be punished with imprisonment... which may extend to two years.",
            "simple": "Taking money to help someone get their stolen stuff back is illegal unless you also do everything you can to help the police catch the thief."
          },
          {
            "number": "Section 253",
            "text": "Whoever... harbours or conceals [a person who escaped from custody or whose arrest was ordered]... with the intention of preventing him from being apprehended... [punishment from 1/4th of the term to seven years]. Exception.—[Does not apply to spouses].",
            "simple": "Hiding a fugitive or someone who escaped from jail to keep them from being caught is a crime. This does not apply if you are hiding your spouse."
          },
          {
            "number": "Section 254",
            "text": "Whoever, knowing... that any persons are about to commit or have recently committed robbery or dacoity, harbours them... shall be punished with rigorous imprisonment... which may extend to seven years, and shall also be liable to fine. Exception.—[Does not apply to spouses].",
            "simple": "Hiding members of a gang of robbers or dacoits is a serious crime carrying up to seven years of hard labor."
          },
          {
            "number": "Section 255",
            "text": "Whoever, being a public servant, knowingly disobeys any direction of the law... intending thereby to save... any person from legal punishment... or with intent to save... any property from forfeiture... shall be punished with imprisonment... which may extend to two years, or with fine, or with both.",
            "simple": "If an official breaks the law specifically to protect someone from being punished or to save their property from being seized, the official can be jailed for two years."
          },
          {
            "number": "Section 256",
            "text": "Whoever, being a public servant... frames [a] record or writing in a manner which he knows to be incorrect, with intent to cause... loss or injury... or with intent thereby to save... any person from legal punishment... shall be punished with imprisonment... which may extend to three years, or with fine, or with both.",
            "simple": "If an official purposely writes a fake or incorrect report to help a criminal or hurt the public, they face up to three years in prison."
          },
          {
            "number": "Section 257",
            "text": "Whoever, being a public servant, corruptly or maliciously makes or pronounces in any stage of a judicial proceeding, any report, order, verdict, or decision which he knows to be contrary to law, shall be punished with imprisonment... which may extend to seven years, or with fine, or with both.",
            "simple": "A judge or official who gives a court ruling or report they *know* is illegal and wrong can be jailed for seven years."
          },
          {
            "number": "Section 258",
            "text": "Whoever, being in any office which gives him legal authority to commit persons for trial or to confinement... corruptly or maliciously commits any person... knowing that in so doing he is acting contrary to law, shall be punished with imprisonment... which may extend to seven years, or with fine, or with both.",
            "simple": "If an official uses their power to send someone to jail or trial while knowing that doing so is illegal, they face seven years in prison."
          },
          {
            "number": "Section 259",
            "text": "Whoever, being a public servant, legally bound... to apprehend... any person charged with... an offence, intentionally omits to apprehend such person, or intentionally suffers such person to escape... [punishment from two to seven years depending on the crime].",
            "simple": "If a policeman or official intentionally lets a criminal go or refuses to arrest them, they are punished based on the seriousness of the criminal's offence."
          },
          {
            "number": "Section 260",
            "text": "Whoever, being a public servant, legally bound... to apprehend... any person under sentence of a Court... intentionally omits to apprehend... or intentionally suffers such person to escape... [punishment from three years to life depending on the sentence].",
            "simple": "If an official intentionally lets a convicted prisoner escape, they can be jailed for three years, seven years, or even life, depending on the prisoner's original sentence."
          },
          {
            "number": "Section 261",
            "text": "Whoever, being a public servant legally bound... to keep in confinement any person... negligently suffers such person to escape from confinement, shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both.",
            "simple": "If an official is simply careless and a prisoner escapes because of that negligence, the official can be jailed for two years."
          },
          {
            "number": "Section 262",
            "text": "Whoever intentionally offers any resistance or illegal obstruction to the lawful apprehension of himself... or escapes or attempts to escape from any custody... shall be punished with imprisonment... which may extend to two years, or with fine, or with both.",
            "simple": "Resisting arrest or escaping from police custody is a crime punishable by up to two years in jail, in addition to whatever crime you were originally being arrested for."
          },
          {
            "number": "Section 263",
            "text": "Whoever, intentionally offers any resistance... to the lawful apprehension of any other person... or rescues or attempts to rescue any other person... [punishment from two to ten years depending on the crime].",
            "simple": "Helping someone else resist arrest or breaking them out of jail is a crime. The penalty increases to up to ten years if the person you helped was facing serious charges or the death penalty."
          },
          {
            "number": "Section 264",
            "text": "Whoever, being a public servant... omits to apprehend that person or suffers him to escape... (a) if he does so intentionally... up to three years; (b) if he does so negligently... up to two years.",
            "simple": "General punishment for officials who let people escape or fail to arrest them in cases not covered by other specific sections."
          },
          {
            "number": "Section 265",
            "text": "Whoever... intentionally offers any resistance... to the lawful apprehension of himself or of any other person... shall be punished with imprisonment... which may extend to six months, or with fine, or with both.",
            "simple": "General punishment (six months) for resisting arrest or helping someone escape in cases not specifically mentioned elsewhere."
          },
          {
            "number": "Section 266",
            "text": "Whoever, having accepted any conditional remission of punishment, knowingly violates any condition... shall be punished with the punishment to which he was originally sentenced [for the remaining term].",
            "simple": "If you are released from jail early on certain conditions (like parole) and you break those conditions, you have to go back to finish your full original sentence."
          },
          {
            "number": "Section 267",
            "text": "Whoever, intentionally offers any insult, or causes any interruption to any public servant, while such public servant is sitting in any stage of a judicial proceeding, shall be punished with simple imprisonment for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Disrupting a court hearing or insulting a judge/official while they are working on a case is punishable by six months in jail."
          },
          {
            "number": "Section 268",
            "text": "Whoever, by personation or otherwise, shall intentionally cause... himself to be returned, empanelled or sworn as an assessor... shall be punished with imprisonment... which may extend to two years, or with fine, or with both.",
            "simple": "Pretending to be someone else to get on a jury or serve as a legal assessor is a crime punishable by two years."
          },
          {
            "number": "Section 269",
            "text": "Whoever, having been charged with an offence and released on bail bond or on bond, fails without sufficient cause... to appear in Court... shall be punished with imprisonment... which may extend to one year, or with fine, or with both.",
            "simple": "Jumping bail: If you are out on bail and don't show up for your court date without a valid reason, you can be jailed for another year and lose your bail money."
          }
        ]
    },

    {
        "title": "BNS: Chapter XV. Of Offences Affecting the Public Health, Safety, Convenience, Decency and Morals",
        "category": "Offences involving public nuisance, spread of disease, adulteration, rash driving, and obscenity.",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 270",
            "text": "A person is guilty of a public nuisance who does any act or is guilty of an illegal omission which causes any common injury, danger or annoyance to the public or to the people in general who dwell or occupy property in the vicinity, or which must necessarily cause injury, obstruction, danger or annoyance to persons who may have occasion to use any public right.",
            "simple": "A public nuisance is any act or failure to act that causes danger, injury, or annoyance to the general public or people living nearby. It also covers things that block or endanger people using public spaces."
          },
          {
            "number": "Section 271",
            "text": "Whoever unlawfully or negligently does any act which is, and which he knows or has reason to believe to be, likely to spread the infection of any disease dangerous to life, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.",
            "simple": "If you carelessly or illegally do something that you know could spread a deadly disease, you can be jailed for six months or fined."
          },
          {
            "number": "Section 272",
            "text": "Whoever malignantly does any act which is, and which he knows or has reason to believe to be, likely to spread the infection of any disease dangerous to life, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
            "simple": "If you purposely or with bad intent do something that spreads a life-threatening disease, the punishment is more severe—up to two years in prison."
          },
          {
            "number": "Section 273",
            "text": "Whoever knowingly disobeys any rule made and promulgated by the Government for putting any vessel into a state of quarantine, or for regulating the intercourse of vessels in a state of quarantine with the shore or with other vessels, or for regulating the intercourse between places where an infectious disease prevails and other places, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both.",
            "simple": "Breaking quarantine rules set by the government, whether for ships or for travel between infected and non-infected areas, is a crime punishable by six months in jail."
          },
          {
            "number": "Section 274",
            "text": "Whoever adulterates any article of food or drink, so as to make such article noxious as food or drink, intending to sell such article as food or drink, or knowing it to be likely that the same will be sold as food or drink, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Mixing harmful substances into food or drink that you plan to sell is illegal and carries a six-month jail term and a 5,000 rupee fine."
          },
          {
            "number": "Section 275",
            "text": "Whoever sells, or offers or exposes for sale, as food or drink, any article which has been rendered or has become noxious, or is in a state unfit for food or drink, knowing or having reason to believe that the same is noxious as food or drink, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Knowingly selling spoiled or harmful food or drink is a crime punishable by six months in prison."
          },
          {
            "number": "Section 276",
            "text": "Whoever adulterates any drug or medical preparation in such a manner as to lessen the efficacy or change the operation of such drug or medical preparation, or to make it noxious, intending that it shall be sold or used for, or knowing it to be likely that it will be sold or used for, any medicinal purpose, as if it had not undergone such adulteration, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Tampering with medicine to make it less effective or harmful while intending it to be sold as real medicine is punishable by six months in jail."
          },
          {
            "number": "Section 277",
            "text": "Whoever, knowing any drug or medical preparation to have been adulterated in such a manner as to lessen its efficacy, to change its operation, or to render it noxious, sells the same, or offers or exposes it for sale, or issues it from any dispensary for medicinal purposes as unadulterated, or causes it to be used for medicinal purposes by any person who has no knowledge of the adulteration, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Selling or giving out adulterated medicine as if it were pure is a crime."
          },
          {
            "number": "Section 278",
            "text": "Whoever knowingly sells, or offers or exposes for sale, or issues from a dispensary for medicinal purposes, any drug or medical preparation, as a different drug or medical preparation, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "It is a crime to sell one medicine while claiming it is a completely different one."
          },
          {
            "number": "Section 279",
            "text": "Whoever voluntarily corrupts or fouls the water of any public spring or reservoir, so as to render it less fit for the purpose for which it is ordinarily used, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Intentionally polluting a public spring or reservoir so the water becomes unusable is punishable by three months in jail."
          },
          {
            "number": "Section 280",
            "text": "Whoever voluntarily vitiates the atmosphere in any place so as to make it noxious to the health of persons in general dwelling or carrying on business in the neighbourhood or passing along a public way, shall be punished with fine which may extend to one thousand rupees.",
            "simple": "Polluting the air to the point where it becomes harmful to the health of people nearby is punishable by a fine of 1,000 rupees."
          },
          {
            "number": "Section 281",
            "text": "Whoever drives any vehicle, or rides, on any public way in a manner so rash or negligent as to endanger human life, or to be likely to cause hurt or injury to any other person, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both.",
            "simple": "Driving or riding a vehicle in a reckless or negligent way that puts lives at risk is punishable by six months in jail or a 1,000 rupee fine."
          },
          {
            "number": "Section 282",
            "text": "Whoever navigates any vessel in a manner so rash or negligent as to endanger human life, or to be likely to cause hurt or injury to any other person, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to one thousand rupees, or with both.",
            "simple": "Operating a boat or ship recklessly so that it endangers others is a crime punishable by six months in jail."
          },
          {
            "number": "Section 283",
            "text": "Whoever exhibits any false light, mark or buoy, intending or knowing it to be likely that such exhibition will mislead any navigator, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine, or with both.",
            "simple": "Showing fake lights or signals to trick a ship's navigator is a serious crime that can lead to seven years in prison."
          },
          {
            "number": "Section 284",
            "text": "Whoever knowingly or negligently conveys, or causes to be conveyed for hire, any person by water in any vessel, when that vessel is in such a state or so loaded as to endanger the life of that person, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Transporting people for money in an unsafe or overloaded boat is illegal and carries a six-month prison sentence."
          },
          {
            "number": "Section 285",
            "text": "Whoever, by doing any act, or by omitting to take order with any property in his possession or under his charge, causes danger, obstruction or injury to any person in any public way or public line of navigation, shall be punished with fine which may extend to five thousand rupees.",
            "simple": "Causing an obstruction or danger in a public road or waterway is punishable by a 5,000 rupee fine."
          },
          {
            "number": "Section 286",
            "text": "Whoever does, with any poisonous substance, any act in a manner so rash or negligent as to endanger human life, or to be likely to cause hurt or injury to any person, or knowingly or negligently omits to take such order with any poisonous substance in his possession as is sufficient to guard against any probable danger to human life... shall be punished with imprisonment... which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Handling poison recklessly or failing to store it safely, resulting in a danger to others, is punishable by six months in jail."
          },
          {
            "number": "Section 287",
            "text": "Whoever does, with fire or any combustible matter, any act in a manner so rash or negligent as to endanger human life... shall be punished with imprisonment... which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Reckless behavior with fire or flammable materials that puts lives at risk is a crime carrying a six-month sentence."
          },
          {
            "number": "Section 288",
            "text": "Whoever does, with any explosive substance, any act in a manner so rash or negligent as to endanger human life... shall be punished with imprisonment... which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Being careless or reckless with explosives is punishable by six months in jail."
          },
          {
            "number": "Section 289",
            "text": "Whoever does, with any machinery, any act in a manner so rash or negligent as to endanger human life... shall be punished with imprisonment... which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Operating machinery recklessly or failing to maintain it safely is a crime punishable by six months in prison."
          },
          {
            "number": "Section 290",
            "text": "Whoever, in pulling down or repairing any building, knowingly or negligently omits to take such order with that building as is sufficient to guard against any probable danger to human life... shall be punished with imprisonment... which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "Being careless while demolishing or repairing a building, leading to public danger, is punishable by six months in jail."
          },
          {
            "number": "Section 291",
            "text": "Whoever knowingly or negligently omits to take such order with any animal in his possession as is sufficient to guard against any probable danger to human life, or any probable danger of grievous hurt from such animal, shall be punished with imprisonment... which may extend to six months, or with fine which may extend to five thousand rupees, or with both.",
            "simple": "If you fail to control your animal and it puts people in danger of serious injury or death, you can be jailed for six months."
          },
          {
            "number": "Section 292",
            "text": "Whoever commits a public nuisance in any case not otherwise punishable by this Sanhita, shall be punished with fine which may extend to one thousand rupees.",
            "simple": "General punishment of a 1,000 rupee fine for any public nuisance not specifically covered by other sections."
          },
          {
            "number": "Section 293",
            "text": "Whoever repeats or continues a public nuisance, having been enjoined by any public servant who has lawful authority to issue such injunction not to repeat or continue such nuisance, shall be punished with simple imprisonment for a term which may extend to six months, or with fine, or with both.",
            "simple": "Ignoring a legal order to stop a public nuisance is punishable by six months in jail."
          },
          {
            "number": "Section 294",
            "text": "(1) Whoever— (a) sells, lets to hire, distributes, publicly exhibits or in any manner puts into circulation, any obscene book, pamphlet, paper, drawing, painting, representation, figure or any other obscene object whatsoever; or (b) imports, exports or conveys... (c) takes part in or receives profits from... shall be punished on first conviction with imprisonment... which may extend to two years, and with fine which may extend to two thousand rupees...",
            "simple": "Selling, distributing, or importing obscene materials (like books, drawings, or digital files) is a crime. First-time offenders face two years in jail; repeat offenders face five years."
          },
          {
            "number": "Section 295",
            "text": "Whoever sells, lets to hire, distributes, exhibits or circulates to any person under the age of eighteen years any such obscene object... shall be punished on first conviction with imprisonment... which may extend to three years, and with fine which may extend to two thousand rupees...",
            "simple": "Selling or giving obscene materials to anyone under 18 is a more serious crime, carrying a three-year sentence for the first offense."
          },
          {
            "number": "Section 296",
            "text": "Whoever, to the annoyance of others— (a) does any obscene act in any public place; or (b) sings, recites or utters any obscene song, ballad or words, in or near any public place, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine, or with both.",
            "simple": "Performing obscene acts or singing obscene songs in public to the annoyance of others is punishable by three months in jail."
          },
          {
            "number": "Section 297",
            "text": "(1) Whoever keeps any office or place for the purpose of drawing any lottery not being a State lottery or a lottery authorised by the State Government, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine, or with both. (2) Whoever publishes any proposal to pay any sum, or to deliver any goods... on any event or contingency relative or applicable to the drawing of any ticket, lot, number or figure in any such lottery, shall be punished with fine which may extend to five thousand rupees.",
            "simple": "Running an unauthorized lottery office is illegal and carries a six-month sentence. Advertising such a lottery is punishable by a 5,000 rupee fine."
          }
        ]
    },

    {
        "title": "BNS: Chapter XVI. Of Offences Relating to Religion",
        "category": "Protection of religious feelings, places of worship, and sacred ceremonies",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 298",
            "text": "Whoever destroys, damages or defiles any place of worship, or any object held sacred by any class of persons with the intention of thereby insulting the religion of any class of persons or with the knowledge that any class of persons is likely to consider such destruction, damage or defilement as an insult to their religion, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
            "simple": "Damaging, destroying, or defiling a place of worship or a sacred object to insult a religion is a crime punishable by up to two years in prison."
          },
          {
            "number": "Section 299",
            "text": "Whoever, with deliberate and malicious intention of outraging the religious feelings of any class of citizens of India, by words, either spoken or written, or by signs or by visible representations or through electronic communication or otherwise, insults or attempts to insult the religion or the religious beliefs of that class, shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
            "simple": "Purposefully insulting a religion or its beliefs through speech, writing, signs, or digital communications to outrage the feelings of its followers is punishable by up to three years in prison."
          },
          {
            "number": "Section 300",
            "text": "Whoever voluntarily causes disturbance to any assembly lawfully engaged in the performance of religious worship, or religious ceremonies, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.",
            "simple": "Intentionally disrupting a legal religious gathering or ceremony is a crime punishable by up to one year in jail."
          },
          {
            "number": "Section 301",
            "text": "Whoever, with the intention of wounding the feelings of any person, or of insulting the religion of any person, or with the knowledge that the feelings of any person are likely to be wounded, or that the religion of any person is likely to be insulted thereby, commits any trespass in any place of worship or in any place of sepulture, or in any place set apart for the performance of funeral rites or as a depository for the remains of the dead, or offers any indignity to any human corpse, or causes disturbance to any persons assembled for the performance of funeral ceremonies, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.",
            "simple": "Trespassing in places of worship, cemeteries, or funeral grounds to insult a religion, or disrespecting a human corpse, is punishable by up to one year in jail."
          },
          {
            "number": "Section 302",
            "text": "Whoever, with the deliberate intention of wounding the religious feelings of any person, utters any word or makes any sound in the hearing of that person or makes any gesture in the sight of that person or places any object in the sight of that person, shall be punished with imprisonment of either description for a term which may extend to one year, or with fine, or with both.",
            "simple": "Using words, making sounds, or making gestures in the presence of a person with the specific goal of hurting their religious feelings is punishable by up to one year in prison."
          }
        ]
    },

    {
        "title": "BNS: Chapter XVII. Of Offences Against Property",
        "category": "Crimes involving theft, extortion, robbery, dacoity, misappropriation, breach of trust, and cheating",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 303",
            "text": "(1) Whoever, intending to take dishonestly any movable property out of the possession of any person without that person’s consent, moves that property in order to such taking, is said to commit theft. (2) Whoever commits theft shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both, and in the case of a second or subsequent conviction of any person under this section, he shall be punished with rigorous imprisonment for a term which shall not be less than one year but which may extend to five years and with fine.",
            "simple": "Theft is defined as moving someone's movable property without their permission with the intent to take it dishonestly. The standard punishment is up to 3 years in jail; repeat offenders face at least 1 year and up to 5 years of hard labor."
          },
          {
            "number": "Section 304",
            "text": "Whoever commits theft in any building, tent or vessel, which building, tent or vessel is used as a human dwelling, or used for the custody of property, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
            "simple": "Stealing from a place where people live or where goods are stored (like a house, tent, or ship) is more serious and carries a punishment of up to 7 years in prison."
          },
          {
            "number": "Section 305",
            "text": "Whoever, being a clerk or servant, or being employed in the capacity of a clerk or servant, commits theft in respect of any property in the possession of his master or employer, shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
            "simple": "If an employee or servant steals property belonging to their employer, the punishment is up to 7 years in jail."
          },
          {
            "number": "Section 306",
            "text": "Whoever commits theft, having made preparation for causing death, or hurt, or restraint, or fear of death, or of hurt, or of restraint, to any person, in order to the committing of such theft, or in order to the effecting of his escape after the committing of such theft, or in order to the retaining of property taken by such theft, shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
            "simple": "If a thief prepares to hurt, kill, or trap someone while committing a theft, escaping, or keeping the stolen goods, they face up to 10 years of hard labor."
          },
          {
            "number": "Section 307",
            "text": "Whoever commits theft of any property from a person’s body or from his immediate possession, is said to commit snatching. (2) Whoever commits snatching shall be punished with imprisonment of either description for a term which may extend to three years, and shall also be liable to fine.",
            "simple": "Snatching is defined as theft specifically taken directly from a person's body or their immediate reach. It is punishable by up to 3 years in prison."
          },
          {
            "number": "Section 308",
            "text": "(1) Whoever intentionally puts any person in fear of any injury to that person, or to any other, and thereby dishonestly induces the person so put in fear to deliver to any person any property, or valuable security or anything signed or sealed which may be converted into a valuable security, commits extortion. (2) Whoever commits extortion shall be punished with imprisonment... which may extend to seven years, or with fine, or with both.",
            "simple": "Extortion is forcing someone to give up property or money by threatening them (or someone else) with injury. The punishment is up to 7 years in prison."
          },
          {
            "number": "Section 309",
            "text": "(1) In all robbery there is either theft or extortion. [Theft is robbery if the offender causes or attempts to cause death, hurt, or wrongful restraint]. [Extortion is robbery if the offender is in the presence of the person put in fear and commits the extortion by putting that person in fear of instant death, instant hurt, or instant wrongful restraint].",
            "simple": "Robbery is an extreme form of theft or extortion. It becomes robbery if the criminal uses or threatens immediate violence (death, hurt, or restraint) to commit the crime or escape."
          },
          {
            "number": "Section 310",
            "text": "(1) When five or more persons conjointly commit or attempt to commit a robbery... every person so committing, attempting or aiding, is said to commit dacoity.",
            "simple": "Dacoity is simply robbery committed by a group of five or more people. Every member of the group is considered a dacoit."
          },
          {
            "number": "Section 311",
            "text": "Whoever commits robbery shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine; and, if the robbery be committed on the highway between sunset and sunrise, the imprisonment may be extended to fourteen years.",
            "simple": "The punishment for robbery is up to 10 years of hard labor. If the robbery happens on a highway at night, the sentence increases to 14 years."
          },
          {
            "number": "Section 312",
            "text": "Whoever attempts to commit robbery shall be punished with rigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine.",
            "simple": "Trying to commit a robbery, even if you fail, carries a sentence of up to 7 years of hard labor."
          },
          {
            "number": "Section 313",
            "text": "If any person, in committing or in attempting to commit robbery, voluntarily causes hurt, such person, and any other person jointly concerned in committing or attempting to commit such robbery, shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
            "simple": "If anyone is hurt during a robbery (or an attempted robbery), everyone involved in the crime faces life imprisonment or 10 years of hard labor."
          },
          {
            "number": "Section 314",
            "text": "Whoever commits dacoity shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
            "simple": "Committing dacoity (group robbery) is punishable by life imprisonment or 10 years of hard labor."
          },
          {
            "number": "Section 315",
            "text": "If any one of five or more persons, who are conjointly committing dacoity, commits murder in so committing dacoity, every one of those persons shall be punished with death, or imprisonment for life, or rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
            "simple": "If a murder happens during a dacoity, every single person in the group—even those who didn't pull the trigger—can be sentenced to death or life imprisonment."
          },
          {
            "number": "Section 316",
            "text": "If, at the time of committing robbery or dacoity, the offender uses any deadly weapon, or causes grievous hurt to any person, or attempts to cause death or grievous hurt to any person, the imprisonment with which such offender shall be punished shall not be less than seven years.",
            "simple": "Using a deadly weapon or causing serious injury during a robbery or dacoity guarantees a minimum sentence of at least 7 years."
          },
          {
            "number": "Section 317",
            "text": "Whoever, at the time of attempting to commit robbery or dacoity, is armed with any deadly weapon, shall be punished with imprisonment for a term which shall not be less than seven years.",
            "simple": "Simply being armed with a deadly weapon while trying to commit robbery or dacoity leads to a minimum 7-year prison sentence."
          },
          {
            "number": "Section 318",
            "text": "Whoever shall be one of a gang of persons associated for the purpose of habitually committing dacoity, shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
            "simple": "Being a member of a professional gang that regularly commits dacoity is punishable by life imprisonment."
          },
          {
            "number": "Section 319",
            "text": "Whoever shall belong to any wandering or other gang of persons, associated for the purpose of habitually committing theft or robbery, and not being a gang of dacoits, shall be punished with rigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine.",
            "simple": "Belonging to a habitual gang of thieves or robbers (fewer than 5 people) is punishable by up to 7 years of hard labor."
          },
          {
            "number": "Section 320",
            "text": "Whoever shall be one of five or more persons assembled for the purpose of committing dacoity, shall be punished with rigorous imprisonment for a term which may extend to seven years, and shall also be liable to fine.",
            "simple": "Just meeting up with a group of 5 or more people to plan a dacoity is a crime punishable by up to 7 years."
          },
          {
            "number": "Section 321",
            "text": "Whoever makes any preparation for committing dacoity, shall be punished with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
            "simple": "Making actual preparations for a dacoity (like getting weapons or scouting locations) is punishable by up to 10 years in jail."
          },
          {
            "number": "Section 322",
            "text": "Whoever dishonestly misappropriates or converts to his own use any movable property, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
            "simple": "Criminal misappropriation is taking property that doesn't belong to you (like something you found on the street) and keeping it for yourself instead of returning it. This carries up to 2 years in jail."
          },
          {
            "number": "Section 323",
            "text": "Whoever dishonestly misappropriates or converts to his own use property knowing that such property was in the possession of a deceased person at the time of that person's decease, and has not since been in the possession of any person legally entitled to it, shall be punished with imprisonment... up to three years [seven years if the offender was a servant/clerk].",
            "simple": "Stealing property from a dead person before their heirs can claim it is a crime punishable by 3 years, or 7 years if the thief was the deceased person's employee."
          },
          {
            "number": "Section 324",
            "text": "Whoever, being in any manner entrusted with property, or with any dominion over property, dishonestly misappropriates or converts to his own use that property... commits criminal breach of trust.",
            "simple": "Criminal Breach of Trust (CBT) occurs when you are trusted with someone's property (like a bank or a friend holding a bag) and you dishonestly use or keep it for yourself."
          },
          {
            "number": "Section 325",
            "text": "Whoever commits criminal breach of trust shall be punished with imprisonment of either description for a term which may extend to five years, or with fine, or with both.",
            "simple": "The standard punishment for breaking someone's trust and stealing their property is up to 5 years in prison."
          },
          {
            "number": "Section 326",
            "text": "(1) Property, the possession whereof has been transferred by theft, or by extortion, or by robbery, and property which has been criminally misappropriated or in respect of which criminal breach of trust has been committed, is designated as 'stolen property'.",
            "simple": "Defines 'stolen property' as anything obtained through theft, extortion, robbery, misappropriation, or breach of trust."
          },
          {
            "number": "Section 327",
            "text": "Whoever dishonestly receives or retains any stolen property, knowing or having reason to believe the same to be stolen property, shall be punished with imprisonment... which may extend to three years, or with fine, or with both.",
            "simple": "Buying or keeping something you know (or should know) is stolen is a crime punishable by up to 3 years."
          },
          {
            "number": "Section 328",
            "text": "Whoever dishonestly receives or retains any stolen property, the possession whereof he knows or has reason to believe to have been transferred by the commission of dacoity... shall be punished with imprisonment for life, or with rigorous imprisonment for a term which may extend to ten years, and shall also be liable to fine.",
            "simple": "If you buy or keep property that was stolen during a dacoity, the punishment is much harsher—up to life imprisonment."
          },
          {
            "number": "Section 329",
            "text": "Whoever habitually receives or deals in property which he knows or has reason to believe to be stolen property, shall be punished with imprisonment for life, or with imprisonment of either description for a term which may extend to ten years, and shall also be liable to fine.",
            "simple": "Being a professional 'fence' or habitually dealing in stolen goods carries a sentence of 10 years to life in prison."
          },
          {
            "number": "Section 330",
            "text": "Whoever voluntarily assists in concealing or disposing of or making away with property which he knows or has reason to believe to be stolen property, shall be punished with imprisonment... which may extend to three years, or with fine, or with both.",
            "simple": "Helping someone hide or get rid of stolen property is punishable by up to 3 years in jail."
          },
          {
            "number": "Section 331",
            "text": "Whoever, by deceiving any person, fraudulently or dishonestly induces the person so deceived to deliver any property to any person... is said to 'cheat'.",
            "simple": "Cheating is using lies or deception to trick someone into giving up property or doing something they wouldn't normally do."
          },
          {
            "number": "Section 332",
            "text": "A person is said to 'cheat by personation' if he cheats by pretending to be some other person, or by knowingly substituting one person for another, or representing that he or any other person is a person other than he or such other person really is.",
            "simple": "This is cheating by pretending to be someone else, like using a fake identity or posing as a famous person."
          },
          {
            "number": "Section 333",
            "text": "Whoever cheats shall be punished with imprisonment of either description for a term which may extend to three years, or with fine, or with both.",
            "simple": "Standard cheating is punishable by up to 3 years in prison."
          },
          {
            "number": "Section 334",
            "text": "Whoever cheats and thereby dishonestly induces the person deceived to deliver any property... shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine.",
            "simple": "If you cheat someone specifically to make them hand over property or valuable documents, the punishment increases to up to 7 years."
          }
        ]
    },

    {
        "title": "BNS: Chapter XVIII. Of Offences Relating to Documents and to Property Marks",
        "category": "Crimes involving forgery, falsification of records, and tampering with ownership marks.",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 335",
            "text": "A person is said to make a false document or false electronic record— (A) Who dishonestly or fraudulently— (i) makes, signs, seals or executes a document or part of a document; (ii) makes or transmits any electronic record or part of any electronic record; (iii) affixes any electronic signature on any electronic record... (B) Who without lawful authority... alters a document or an electronic record... (C) Who dishonestly or fraudulently causes any person to sign, seal, execute or alter a document... [knowing the person is unable to understand the contents due to unsoundness of mind, intoxication, or deception].",
            "simple": "This defines 'faking it.' It covers creating, signing, or altering documents and digital records to trick people into thinking they are legitimate or authorized by someone else. It also includes tricking people who are drunk or mentally incapacitated into signing things."
          },
          {
            "number": "Section 336",
            "text": "(1) Whoever makes any false document or false electronic record... with intent to cause damage or injury... or with intent to commit fraud... commits forgery. (2) Whoever commits forgery shall be punished with imprisonment... which may extend to two years... (3) [If used for cheating]: up to seven years. (4) [If used to harm reputation]: up to three years.",
            "simple": "The basic rule against forgery. If you make fake documents to commit fraud or hurt someone, you can get 2 years. If you use those fakes to actually cheat people, that's a 7-year upgrade. If you just wanted to ruin someone's reputation, it's 3 years."
          },
          {
            "number": "Section 337",
            "text": "Whoever forges a document or an electronic record, purporting to be a record or proceeding of or in a Court or an identity document issued by Government including voter identity card or Aadhaar Card... shall be punished with imprisonment... which may extend to seven years, and shall also be liable to fine.",
            "simple": "Don't mess with the government's paperwork. Forging court records, birth certificates, or IDs like Aadhaar or Voter cards is a specific crime carrying up to 7 years in prison."
          },
          {
            "number": "Section 338",
            "text": "Whoever forges a document which purports to be a valuable security or a will, or an authority to adopt a son... shall be punished with imprisonment for life, or with imprisonment... which may extend to ten years, and shall also be liable to fine.",
            "simple": "Forging high-stakes documents like wills, cheques, or adoption papers is a major offence. You could spend the rest of your life in prison for this, or at least a decade."
          },
          {
            "number": "Section 339",
            "text": "Whoever has in his possession any document or electronic record, knowing the same to be forged and intending that the same shall fraudulently or dishonestly be used as genuine... [punishment based on the type of forged document].",
            "simple": "Simply holding onto forged IDs or valuable securities with the plan to use them is a crime. The punishment matches the severity of the forgery itself."
          },
          {
            "number": "Section 340",
            "text": "(1) A false document or electronic record made wholly or in part by forgery is designated a forged document or electronic record. (2) Whoever fraudulently or dishonestly uses as genuine any document... which he knows... to be a forged document... shall be punished in the same manner as if he had forged such document.",
            "simple": "If you try to use a fake document as if it were real, the law treats you exactly like the person who forged it. Knowing better doesn't save you."
          },
          {
            "number": "Section 341",
            "text": "(1) Whoever makes or counterfeits any seal, plate or other instrument... intending that the same shall be used for the purpose of committing any forgery which would be punishable under section 338... shall be punished with imprisonment for life, or... seven years... (2) [For other forgeries]: up to seven years.",
            "simple": "Making or owning the tools used for forgery—like fake seals or printing plates—is illegal. If the tools are for forging wills or money, the penalty goes up to life imprisonment."
          },
          {
            "number": "Section 342",
            "text": "(1) Whoever counterfeits upon... any material, any device or mark used for the purpose of authenticating any document described in section 338... [punishment up to life or seven years]. (2) [For other documents]: up to seven years.",
            "simple": "This covers faking security features like watermarks or authentication marks used on valuable documents. It's an elaborate way to get 7 years to life in prison."
          },
          {
            "number": "Section 343",
            "text": "Whoever fraudulently or dishonestly... cancels, destroys or defaces... any document which is or purports to be a will, or an authority to adopt a son, or any valuable security... shall be punished with imprisonment for life, or... seven years.",
            "simple": "Purposely destroying or hiding someone's will or a valuable document to cheat them is treated as a top-tier crime, punishable by up to life in prison."
          },
          {
            "number": "Section 344",
            "text": "Whoever, being a clerk, officer or servant... wilfully, and with intent to defraud, destroys, alters, mutilates or falsifies any book, electronic record... which belongs to... his employer... shall be punished with imprisonment... which may extend to seven years, or with fine, or with both.",
            "simple": "This is for employees who 'cook the books.' If you mess with your employer's records or accounts to commit fraud, you face up to 7 years in jail."
          },
          {
            "number": "Section 345",
            "text": "(1) A mark used for denoting that movable property belongs to a particular person is called a property mark. (2) Whoever marks any movable property... in a manner reasonably calculated to cause it to be believed that the property... belong to a person to whom they do not belong, is said to use a false property mark. (3) [Punishment]: up to one year.",
            "simple": "Using a fake mark to pretend someone else's stuff belongs to you (or vice versa) is illegal. It's a quick way to earn a 1-year prison sentence."
          },
          {
            "number": "Section 346",
            "text": "Whoever removes, destroys, defaces or adds to any property mark, intending or knowing it to be likely that he may thereby cause injury to any person, shall be punished with imprisonment... which may extend to one year, or with fine, or with both.",
            "simple": "Vandalizing or removing an ownership mark on property to cause someone trouble can land you in jail for a year."
          },
          {
            "number": "Section 347",
            "text": "(1) Whoever counterfeits any property mark used by any other person shall be punished with imprisonment... which may extend to two years... (2) Whoever counterfeits any property mark used by a public servant... to denote quality... or passed through a particular office... shall be punished [with up to three years].",
            "simple": "Faking someone else's property mark carries 2 years. Faking a government mark (used to show quality or that taxes were paid) is more serious and carries 3 years."
          },
          {
            "number": "Section 348",
            "text": "Whoever makes or has in his possession any die, plate or other instrument for the purpose of counterfeiting a property mark... shall be punished with imprisonment... which may extend to three years, or with fine, or with both.",
            "simple": "Owning the 'printer' or stamps used to create fake property marks is a crime punishable by up to 3 years."
          },
          {
            "number": "Section 349",
            "text": "Whoever sells, or exposes... for sale, any goods or things with a counterfeit property mark... [unless they prove they acted in good faith and shared where they got the goods]... shall be punished with imprisonment... which may extend to one year, or with fine, or with both.",
            "simple": "Selling items with fake property marks is illegal. You only get off the hook if you can prove you were tricked and tell the police who sold the fakes to you."
          },
          {
            "number": "Section 350",
            "text": "(1) Whoever makes any false mark upon any case, package or other receptacle containing goods, in a manner reasonably calculated to cause any public servant or any other person to believe that such receptacle contains goods which it does not contain... shall... be punished with imprisonment... which may extend to three years, or with fine, or with both.",
            "simple": "Tricking people about what's inside a box or the quality of the goods by using fake labels or marks is punishable by up to 3 years in prison."
          }
        ]
    },

    {
        "title": "BNS: Chapter XIX. Of Criminal Intimidation, Insult, Annoyance, Defamation, Etc.",
        "category": "Offences involving threats, public mischief, drunkenness, and defamation",
        "jurisdiction": "National",
        "sections": [
          {
            "number": "Section 351",
            "text": "(1) Whoever threatens another by any means, with any injury to his person, reputation or property... with intent to cause alarm... or to cause that person to do any act which he is not legally bound to do... commits criminal intimidation. (2) [Punishment]: imprisonment up to two years, or with fine, or with both. (3) [If threat is to cause death or grievous hurt]: imprisonment up to seven years. (4) [If anonymous]: additional imprisonment up to two years.",
            "simple": "Criminal intimidation is threatening someone (or their reputation/property) to scare them or force them to do something they don't want to do. Basic threats carry 2 years in jail, but threatening death or serious injury can lead to 7 years. Using an anonymous message to threaten someone adds an extra 2 years."
          },
          {
            "number": "Section 352",
            "text": "Whoever intentionally insults in any manner, and thereby gives provocation to any person, intending or knowing it to be likely that such provocation will cause him to break the public peace, or to commit any other offence, shall be punished with imprisonment of either description for a term which may extend to two years, or with fine, or with both.",
            "simple": "Purposefully insulting someone to provoke them into starting a fight or breaking the law is a crime punishable by up to 2 years in prison."
          },
          {
            "number": "Section 353",
            "text": "(1) Whoever makes, publishes or circulates any statement, false information, rumour, or report... (a) with intent to cause mutiny in the armed forces; (b) with intent to cause fear or alarm to the public whereby any person may be induced to commit an offence against the State or public tranquillity; (c) with intent to incite one class or community against another... [Punishment: up to three years]. (2) [Creating hatred between groups]: up to three years. (3) [If in a place of worship]: up to five years.",
            "simple": "This covers spreading rumors or false information that could cause a military mutiny, create public panic, or incite different communities to fight each other. The punishment is 3 years, which increases to 5 years if the act is committed in a place of worship."
          },
          {
            "number": "Section 354",
            "text": "Whoever voluntarily causes or attempts to cause any person to do anything which that person is not legally bound to do... by inducing or attempting to induce that person to believe that he or any person in whom he is interested will become... an object of Divine displeasure... shall be punished with imprisonment... which may extend to one year, or with fine, or with both.",
            "simple": "It is illegal to force someone to do something by making them believe they (or their family) will face 'divine' or spiritual punishment if they don't comply. This carries up to 1 year in jail."
          },
          {
            "number": "Section 355",
            "text": "Whoever, in a state of intoxication, appears in any public place... and there conducts himself in such a manner as to cause annoyance to any person, shall be punished with simple imprisonment for a term which may extend to twenty-four hours, or with fine which may extend to one thousand rupees, or with both or with community service.",
            "simple": "Being drunk in public and annoying others is a minor offence punishable by 24 hours in jail, a 1,000 rupee fine, or community service."
          },
          {
            "number": "Section 356",
            "text": "(1) Whoever, by words either spoken or intended to be read, or by signs or by visible representations, makes or publishes in any manner, any imputation concerning any person intending to harm... the reputation of such person... is said to defame that person. (2) Whoever defames another shall be punished with simple imprisonment for a term which may extend to two years, or with fine, or with both or with community service.",
            "simple": "Defamation is intentionally harming someone's reputation by making false claims about them through speech, writing, or images. It is punishable by up to 2 years in prison, a fine, or community service. The law includes several exceptions for true statements made for the public good or fair criticism of public servants and performances."
          }
        ]
    }

]